/* automatically generated by rust-bindgen 0.60.1 */

pub type __uint8_t = libc::c_uchar;
pub type __int32_t = libc::c_int;
pub type __uint32_t = libc::c_uint;
pub type __int64_t = libc::c_long;
pub type __uint64_t = libc::c_ulong;
pub const godot_error_GODOT_OK: godot_error = 0;
#[doc = "< Generic fail error"]
pub const godot_error_GODOT_FAILED: godot_error = 1;
#[doc = "< What is requested is unsupported/unavailable"]
pub const godot_error_GODOT_ERR_UNAVAILABLE: godot_error = 2;
#[doc = "< The object being used hasn't been properly set up yet"]
pub const godot_error_GODOT_ERR_UNCONFIGURED: godot_error = 3;
#[doc = "< Missing credentials for requested resource"]
pub const godot_error_GODOT_ERR_UNAUTHORIZED: godot_error = 4;
#[doc = "< Parameter given out of range (5)"]
pub const godot_error_GODOT_ERR_PARAMETER_RANGE_ERROR: godot_error = 5;
#[doc = "< Out of memory"]
pub const godot_error_GODOT_ERR_OUT_OF_MEMORY: godot_error = 6;
pub const godot_error_GODOT_ERR_FILE_NOT_FOUND: godot_error = 7;
pub const godot_error_GODOT_ERR_FILE_BAD_DRIVE: godot_error = 8;
pub const godot_error_GODOT_ERR_FILE_BAD_PATH: godot_error = 9;
pub const godot_error_GODOT_ERR_FILE_NO_PERMISSION: godot_error = 10;
pub const godot_error_GODOT_ERR_FILE_ALREADY_IN_USE: godot_error = 11;
pub const godot_error_GODOT_ERR_FILE_CANT_OPEN: godot_error = 12;
pub const godot_error_GODOT_ERR_FILE_CANT_WRITE: godot_error = 13;
pub const godot_error_GODOT_ERR_FILE_CANT_READ: godot_error = 14;

#[doc = "< Can't open a resource/socket/file"]
pub const godot_error_GODOT_ERR_CANT_OPEN: godot_error = 19;
pub const godot_error_GODOT_ERR_CANT_CREATE: godot_error = 20;
pub const godot_error_GODOT_ERR_QUERY_FAILED: godot_error = 21;
pub const godot_error_GODOT_ERR_ALREADY_IN_USE: godot_error = 22;
#[doc = "< resource is locked"]
pub const godot_error_GODOT_ERR_LOCKED: godot_error = 23;
pub const godot_error_GODOT_ERR_TIMEOUT: godot_error = 24;
pub const godot_error_GODOT_ERR_CANT_CONNECT: godot_error = 25;
pub const godot_error_GODOT_ERR_CANT_RESOLVE: godot_error = 26;
pub const godot_error_GODOT_ERR_CONNECTION_ERROR: godot_error = 27;
pub const godot_error_GODOT_ERR_CANT_ACQUIRE_RESOURCE: godot_error = 28;
pub const godot_error_GODOT_ERR_CANT_FORK: godot_error = 29;
#[doc = "< Data passed is invalid (30)"]
pub const godot_error_GODOT_ERR_INVALID_DATA: godot_error = 30;
#[doc = "< Parameter passed is invalid"]
pub const godot_error_GODOT_ERR_INVALID_PARAMETER: godot_error = 31;
#[doc = "< When adding, item already exists"]
pub const godot_error_GODOT_ERR_ALREADY_EXISTS: godot_error = 32;
#[doc = "< When retrieving/erasing, it item does not exist"]
pub const godot_error_GODOT_ERR_DOES_NOT_EXIST: godot_error = 33;
#[doc = "< database is full"]
pub const godot_error_GODOT_ERR_DATABASE_CANT_READ: godot_error = 34;
#[doc = "< database is full (35)"]
pub const godot_error_GODOT_ERR_DATABASE_CANT_WRITE: godot_error = 35;
pub const godot_error_GODOT_ERR_COMPILATION_FAILED: godot_error = 36;
pub const godot_error_GODOT_ERR_METHOD_NOT_FOUND: godot_error = 37;
pub const godot_error_GODOT_ERR_LINK_FAILED: godot_error = 38;
pub const godot_error_GODOT_ERR_SCRIPT_FAILED: godot_error = 39;
pub const godot_error_GODOT_ERR_CYCLIC_LINK: godot_error = 40;
pub const godot_error_GODOT_ERR_INVALID_DECLARATION: godot_error = 41;
pub const godot_error_GODOT_ERR_DUPLICATE_SYMBOL: godot_error = 42;
pub const godot_error_GODOT_ERR_PARSE_ERROR: godot_error = 43;
pub const godot_error_GODOT_ERR_BUSY: godot_error = 44;
pub const godot_error_GODOT_ERR_SKIP: godot_error = 45;
#[doc = "< user requested help!!"]
pub const godot_error_GODOT_ERR_HELP: godot_error = 46;
#[doc = "< a bug in the software certainly happened, due to a double check failing or unexpected behavior."]
pub const godot_error_GODOT_ERR_BUG: godot_error = 47;
pub const godot_error_GODOT_ERR_PRINTER_ON_FIRE: godot_error = 48;
#[doc = " Error"]
pub type godot_error = libc::c_uint;
#[doc = " bool"]
pub type godot_bool = bool;
#[doc = " int"]
pub type godot_int = libc::c_int;
#[doc = " real"]
pub type godot_real = f32;
#[doc = " Object (forward declared)"]
pub type godot_object = libc::c_void;
pub type wchar_t = libc::c_int;
pub type godot_char_type = wchar_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_string {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_string() {
    assert_eq!(
        ::std::mem::size_of::<godot_string>(),
        8usize,
        concat!("Size of: ", stringify!(godot_string))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_string>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_string))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_string>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_string),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_char_string {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_char_string() {
    assert_eq!(
        ::std::mem::size_of::<godot_char_string>(),
        8usize,
        concat!("Size of: ", stringify!(godot_char_string))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_char_string>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_char_string))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_char_string>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_char_string),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_array_read_access {
    pub _dont_touch_that: [u8; 1usize],
}
#[test]
fn bindgen_test_layout_godot_pool_array_read_access() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_array_read_access>(),
        1usize,
        concat!("Size of: ", stringify!(godot_pool_array_read_access))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_array_read_access>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_array_read_access))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_array_read_access>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_array_read_access),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
pub type godot_pool_byte_array_read_access = godot_pool_array_read_access;
pub type godot_pool_int_array_read_access = godot_pool_array_read_access;
pub type godot_pool_real_array_read_access = godot_pool_array_read_access;
pub type godot_pool_string_array_read_access = godot_pool_array_read_access;
pub type godot_pool_vector2_array_read_access = godot_pool_array_read_access;
pub type godot_pool_vector3_array_read_access = godot_pool_array_read_access;
pub type godot_pool_color_array_read_access = godot_pool_array_read_access;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_array_write_access {
    pub _dont_touch_that: [u8; 1usize],
}
#[test]
fn bindgen_test_layout_godot_pool_array_write_access() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_array_write_access>(),
        1usize,
        concat!("Size of: ", stringify!(godot_pool_array_write_access))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_array_write_access>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_array_write_access))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_array_write_access>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_array_write_access),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
pub type godot_pool_byte_array_write_access = godot_pool_array_write_access;
pub type godot_pool_int_array_write_access = godot_pool_array_write_access;
pub type godot_pool_real_array_write_access = godot_pool_array_write_access;
pub type godot_pool_string_array_write_access = godot_pool_array_write_access;
pub type godot_pool_vector2_array_write_access = godot_pool_array_write_access;
pub type godot_pool_vector3_array_write_access = godot_pool_array_write_access;
pub type godot_pool_color_array_write_access = godot_pool_array_write_access;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_byte_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_pool_byte_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_byte_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_pool_byte_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_byte_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_byte_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_byte_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_byte_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_int_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_pool_int_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_int_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_pool_int_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_int_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_int_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_int_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_int_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_real_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_pool_real_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_real_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_pool_real_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_real_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_real_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_real_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_real_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_string_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_pool_string_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_string_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_pool_string_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_string_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_string_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_string_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_string_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_vector2_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_pool_vector2_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_vector2_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_pool_vector2_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_vector2_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_vector2_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_vector2_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_vector2_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_vector3_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_pool_vector3_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_vector3_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_pool_vector3_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_vector3_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_vector3_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_vector3_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_vector3_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pool_color_array {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_pool_color_array() {
    assert_eq!(
        ::std::mem::size_of::<godot_pool_color_array>(),
        8usize,
        concat!("Size of: ", stringify!(godot_pool_color_array))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pool_color_array>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_pool_color_array))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pool_color_array>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pool_color_array),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_color {
    pub _dont_touch_that: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_godot_color() {
    assert_eq!(
        ::std::mem::size_of::<godot_color>(),
        16usize,
        concat!("Size of: ", stringify!(godot_color))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_color>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_color))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_color>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_color),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_vector2 {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_vector2() {
    assert_eq!(
        ::std::mem::size_of::<godot_vector2>(),
        8usize,
        concat!("Size of: ", stringify!(godot_vector2))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_vector2>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_vector2))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_vector2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_vector2),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_vector3 {
    pub _dont_touch_that: [u8; 12usize],
}
#[test]
fn bindgen_test_layout_godot_vector3() {
    assert_eq!(
        ::std::mem::size_of::<godot_vector3>(),
        12usize,
        concat!("Size of: ", stringify!(godot_vector3))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_vector3>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_vector3))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_vector3>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_vector3),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_basis {
    pub _dont_touch_that: [u8; 36usize],
}
#[test]
fn bindgen_test_layout_godot_basis() {
    assert_eq!(
        ::std::mem::size_of::<godot_basis>(),
        36usize,
        concat!("Size of: ", stringify!(godot_basis))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_basis>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_basis))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_basis>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_basis),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
impl Default for godot_basis {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_quat {
    pub _dont_touch_that: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_godot_quat() {
    assert_eq!(
        ::std::mem::size_of::<godot_quat>(),
        16usize,
        concat!("Size of: ", stringify!(godot_quat))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_quat>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_quat))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_quat>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_quat),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
pub const godot_vector3_axis_GODOT_VECTOR3_AXIS_X: godot_vector3_axis = 0;
pub const godot_vector3_axis_GODOT_VECTOR3_AXIS_Y: godot_vector3_axis = 1;
pub const godot_vector3_axis_GODOT_VECTOR3_AXIS_Z: godot_vector3_axis = 2;
pub type godot_vector3_axis = libc::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_variant {
    pub _dont_touch_that: [u8; 24usize],
}
#[test]
fn bindgen_test_layout_godot_variant() {
    assert_eq!(
        ::std::mem::size_of::<godot_variant>(),
        24usize,
        concat!("Size of: ", stringify!(godot_variant))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_variant>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_variant))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_variant>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_variant),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
pub const godot_variant_type_GODOT_VARIANT_TYPE_NIL: godot_variant_type = 0;
pub const godot_variant_type_GODOT_VARIANT_TYPE_BOOL: godot_variant_type = 1;
pub const godot_variant_type_GODOT_VARIANT_TYPE_INT: godot_variant_type = 2;
pub const godot_variant_type_GODOT_VARIANT_TYPE_REAL: godot_variant_type = 3;
pub const godot_variant_type_GODOT_VARIANT_TYPE_STRING: godot_variant_type = 4;
pub const godot_variant_type_GODOT_VARIANT_TYPE_VECTOR2: godot_variant_type = 5;
pub const godot_variant_type_GODOT_VARIANT_TYPE_RECT2: godot_variant_type = 6;
pub const godot_variant_type_GODOT_VARIANT_TYPE_VECTOR3: godot_variant_type = 7;
pub const godot_variant_type_GODOT_VARIANT_TYPE_TRANSFORM2D: godot_variant_type = 8;
pub const godot_variant_type_GODOT_VARIANT_TYPE_PLANE: godot_variant_type = 9;
pub const godot_variant_type_GODOT_VARIANT_TYPE_QUAT: godot_variant_type = 10;
pub const godot_variant_type_GODOT_VARIANT_TYPE_AABB: godot_variant_type = 11;
pub const godot_variant_type_GODOT_VARIANT_TYPE_BASIS: godot_variant_type = 12;
pub const godot_variant_type_GODOT_VARIANT_TYPE_TRANSFORM: godot_variant_type = 13;
pub const godot_variant_type_GODOT_VARIANT_TYPE_COLOR: godot_variant_type = 14;
pub const godot_variant_type_GODOT_VARIANT_TYPE_NODE_PATH: godot_variant_type = 15;
pub const godot_variant_type_GODOT_VARIANT_TYPE_RID: godot_variant_type = 16;
pub const godot_variant_type_GODOT_VARIANT_TYPE_OBJECT: godot_variant_type = 17;
pub const godot_variant_type_GODOT_VARIANT_TYPE_DICTIONARY: godot_variant_type = 18;
pub const godot_variant_type_GODOT_VARIANT_TYPE_ARRAY: godot_variant_type = 19;
pub const godot_variant_type_GODOT_VARIANT_TYPE_POOL_BYTE_ARRAY: godot_variant_type = 20;
pub const godot_variant_type_GODOT_VARIANT_TYPE_POOL_INT_ARRAY: godot_variant_type = 21;
pub const godot_variant_type_GODOT_VARIANT_TYPE_POOL_REAL_ARRAY: godot_variant_type = 22;
pub const godot_variant_type_GODOT_VARIANT_TYPE_POOL_STRING_ARRAY: godot_variant_type = 23;
pub const godot_variant_type_GODOT_VARIANT_TYPE_POOL_VECTOR2_ARRAY: godot_variant_type = 24;
pub const godot_variant_type_GODOT_VARIANT_TYPE_POOL_VECTOR3_ARRAY: godot_variant_type = 25;
pub const godot_variant_type_GODOT_VARIANT_TYPE_POOL_COLOR_ARRAY: godot_variant_type = 26;
pub type godot_variant_type = libc::c_uint;
pub const godot_variant_call_error_error_GODOT_CALL_ERROR_CALL_OK: godot_variant_call_error_error =
    0;
pub const godot_variant_call_error_error_GODOT_CALL_ERROR_CALL_ERROR_INVALID_METHOD:
    godot_variant_call_error_error = 1;
pub const godot_variant_call_error_error_GODOT_CALL_ERROR_CALL_ERROR_INVALID_ARGUMENT:
    godot_variant_call_error_error = 2;
pub const godot_variant_call_error_error_GODOT_CALL_ERROR_CALL_ERROR_TOO_MANY_ARGUMENTS:
    godot_variant_call_error_error = 3;
pub const godot_variant_call_error_error_GODOT_CALL_ERROR_CALL_ERROR_TOO_FEW_ARGUMENTS:
    godot_variant_call_error_error = 4;
pub const godot_variant_call_error_error_GODOT_CALL_ERROR_CALL_ERROR_INSTANCE_IS_NULL:
    godot_variant_call_error_error = 5;
pub type godot_variant_call_error_error = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_variant_call_error {
    pub error: godot_variant_call_error_error,
    pub argument: libc::c_int,
    pub expected: godot_variant_type,
}
#[test]
fn bindgen_test_layout_godot_variant_call_error() {
    assert_eq!(
        ::std::mem::size_of::<godot_variant_call_error>(),
        12usize,
        concat!("Size of: ", stringify!(godot_variant_call_error))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_variant_call_error>(),
        4usize,
        concat!("Alignment of ", stringify!(godot_variant_call_error))
    );
    fn test_field_error() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_variant_call_error>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).error) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_variant_call_error),
                "::",
                stringify!(error)
            )
        );
    }
    test_field_error();
    fn test_field_argument() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_variant_call_error>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).argument) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_variant_call_error),
                "::",
                stringify!(argument)
            )
        );
    }
    test_field_argument();
    fn test_field_expected() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_variant_call_error>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).expected) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_variant_call_error),
                "::",
                stringify!(expected)
            )
        );
    }
    test_field_expected();
}
impl Default for godot_variant_call_error {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const godot_variant_operator_GODOT_VARIANT_OP_EQUAL: godot_variant_operator = 0;
pub const godot_variant_operator_GODOT_VARIANT_OP_NOT_EQUAL: godot_variant_operator = 1;
pub const godot_variant_operator_GODOT_VARIANT_OP_LESS: godot_variant_operator = 2;
pub const godot_variant_operator_GODOT_VARIANT_OP_LESS_EQUAL: godot_variant_operator = 3;
pub const godot_variant_operator_GODOT_VARIANT_OP_GREATER: godot_variant_operator = 4;
pub const godot_variant_operator_GODOT_VARIANT_OP_GREATER_EQUAL: godot_variant_operator = 5;
pub const godot_variant_operator_GODOT_VARIANT_OP_ADD: godot_variant_operator = 6;
pub const godot_variant_operator_GODOT_VARIANT_OP_SUBTRACT: godot_variant_operator = 7;
pub const godot_variant_operator_GODOT_VARIANT_OP_MULTIPLY: godot_variant_operator = 8;
pub const godot_variant_operator_GODOT_VARIANT_OP_DIVIDE: godot_variant_operator = 9;
pub const godot_variant_operator_GODOT_VARIANT_OP_NEGATE: godot_variant_operator = 10;
pub const godot_variant_operator_GODOT_VARIANT_OP_POSITIVE: godot_variant_operator = 11;
pub const godot_variant_operator_GODOT_VARIANT_OP_MODULE: godot_variant_operator = 12;
pub const godot_variant_operator_GODOT_VARIANT_OP_STRING_CONCAT: godot_variant_operator = 13;
pub const godot_variant_operator_GODOT_VARIANT_OP_SHIFT_LEFT: godot_variant_operator = 14;
pub const godot_variant_operator_GODOT_VARIANT_OP_SHIFT_RIGHT: godot_variant_operator = 15;
pub const godot_variant_operator_GODOT_VARIANT_OP_BIT_AND: godot_variant_operator = 16;
pub const godot_variant_operator_GODOT_VARIANT_OP_BIT_OR: godot_variant_operator = 17;
pub const godot_variant_operator_GODOT_VARIANT_OP_BIT_XOR: godot_variant_operator = 18;
pub const godot_variant_operator_GODOT_VARIANT_OP_BIT_NEGATE: godot_variant_operator = 19;
pub const godot_variant_operator_GODOT_VARIANT_OP_AND: godot_variant_operator = 20;
pub const godot_variant_operator_GODOT_VARIANT_OP_OR: godot_variant_operator = 21;
pub const godot_variant_operator_GODOT_VARIANT_OP_XOR: godot_variant_operator = 22;
pub const godot_variant_operator_GODOT_VARIANT_OP_NOT: godot_variant_operator = 23;
pub const godot_variant_operator_GODOT_VARIANT_OP_IN: godot_variant_operator = 24;
pub const godot_variant_operator_GODOT_VARIANT_OP_MAX: godot_variant_operator = 25;
pub type godot_variant_operator = libc::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_aabb {
    pub _dont_touch_that: [u8; 24usize],
}
#[test]
fn bindgen_test_layout_godot_aabb() {
    assert_eq!(
        ::std::mem::size_of::<godot_aabb>(),
        24usize,
        concat!("Size of: ", stringify!(godot_aabb))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_aabb>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_aabb))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_aabb>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_aabb),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_plane {
    pub _dont_touch_that: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_godot_plane() {
    assert_eq!(
        ::std::mem::size_of::<godot_plane>(),
        16usize,
        concat!("Size of: ", stringify!(godot_plane))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_plane>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_plane))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_plane>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_plane),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_dictionary {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_dictionary() {
    assert_eq!(
        ::std::mem::size_of::<godot_dictionary>(),
        8usize,
        concat!("Size of: ", stringify!(godot_dictionary))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_dictionary>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_dictionary))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_dictionary>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_dictionary),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_node_path {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_node_path() {
    assert_eq!(
        ::std::mem::size_of::<godot_node_path>(),
        8usize,
        concat!("Size of: ", stringify!(godot_node_path))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_node_path>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_node_path))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_node_path>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_node_path),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_rect2 {
    pub _dont_touch_that: [u8; 16usize],
}
#[test]
fn bindgen_test_layout_godot_rect2() {
    assert_eq!(
        ::std::mem::size_of::<godot_rect2>(),
        16usize,
        concat!("Size of: ", stringify!(godot_rect2))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_rect2>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_rect2))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_rect2>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_rect2),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_rid {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_rid() {
    assert_eq!(
        ::std::mem::size_of::<godot_rid>(),
        8usize,
        concat!("Size of: ", stringify!(godot_rid))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_rid>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_rid))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_rid>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_rid),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_transform {
    pub _dont_touch_that: [u8; 48usize],
}
#[test]
fn bindgen_test_layout_godot_transform() {
    assert_eq!(
        ::std::mem::size_of::<godot_transform>(),
        48usize,
        concat!("Size of: ", stringify!(godot_transform))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_transform>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_transform))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_transform>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_transform),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
impl Default for godot_transform {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_transform2d {
    pub _dont_touch_that: [u8; 24usize],
}
#[test]
fn bindgen_test_layout_godot_transform2d() {
    assert_eq!(
        ::std::mem::size_of::<godot_transform2d>(),
        24usize,
        concat!("Size of: ", stringify!(godot_transform2d))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_transform2d>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_transform2d))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_transform2d>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_transform2d),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_string_name {
    pub _dont_touch_that: [u8; 8usize],
}
#[test]
fn bindgen_test_layout_godot_string_name() {
    assert_eq!(
        ::std::mem::size_of::<godot_string_name>(),
        8usize,
        concat!("Size of: ", stringify!(godot_string_name))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_string_name>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_string_name))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_string_name>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_string_name),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[doc = " MethodBind API"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_method_bind {
    pub _dont_touch_that: [u8; 1usize],
}
#[test]
fn bindgen_test_layout_godot_method_bind() {
    assert_eq!(
        ::std::mem::size_of::<godot_method_bind>(),
        1usize,
        concat!("Size of: ", stringify!(godot_method_bind))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_method_bind>(),
        1usize,
        concat!("Alignment of ", stringify!(godot_method_bind))
    );
    fn test_field__dont_touch_that() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_method_bind>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr)._dont_touch_that) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_method_bind),
                "::",
                stringify!(_dont_touch_that)
            )
        );
    }
    test_field__dont_touch_that();
}
#[doc = " Script API"]
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_gdnative_api_version {
    pub major: libc::c_uint,
    pub minor: libc::c_uint,
}
#[test]
fn bindgen_test_layout_godot_gdnative_api_version() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_api_version>(),
        8usize,
        concat!("Size of: ", stringify!(godot_gdnative_api_version))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_api_version>(),
        4usize,
        concat!("Alignment of ", stringify!(godot_gdnative_api_version))
    );
    fn test_field_major() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_api_version>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).major) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_api_version),
                "::",
                stringify!(major)
            )
        );
    }
    test_field_major();
    fn test_field_minor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_api_version>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).minor) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_api_version),
                "::",
                stringify!(minor)
            )
        );
    }
    test_field_minor();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
}
#[test]
fn bindgen_test_layout_godot_gdnative_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_api_struct>(),
        24usize,
        concat!("Size of: ", stringify!(godot_gdnative_api_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_api_struct>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_gdnative_api_struct))
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
impl Default for godot_gdnative_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_init_options {
    pub in_editor: godot_bool,
    pub core_api_hash: u64,
    pub editor_api_hash: u64,
    pub no_api_hash: u64,
    pub report_version_mismatch: ::std::option::Option<
        unsafe extern "C" fn(
            p_library: *const godot_object,
            p_what: *const libc::c_char,
            p_want: godot_gdnative_api_version,
            p_have: godot_gdnative_api_version,
        ),
    >,
    pub report_loading_error: ::std::option::Option<
        unsafe extern "C" fn(p_library: *const godot_object, p_what: *const libc::c_char),
    >,
    pub gd_native_library: *mut godot_object,
    pub api_struct: *const godot_gdnative_core_api_struct,
    pub active_library_path: *const godot_string,
}
#[test]
fn bindgen_test_layout_godot_gdnative_init_options() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_init_options>(),
        72usize,
        concat!("Size of: ", stringify!(godot_gdnative_init_options))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_init_options>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_gdnative_init_options))
    );
    fn test_field_in_editor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).in_editor) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(in_editor)
            )
        );
    }
    test_field_in_editor();
    fn test_field_core_api_hash() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).core_api_hash) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(core_api_hash)
            )
        );
    }
    test_field_core_api_hash();
    fn test_field_editor_api_hash() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).editor_api_hash) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(editor_api_hash)
            )
        );
    }
    test_field_editor_api_hash();
    fn test_field_no_api_hash() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).no_api_hash) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(no_api_hash)
            )
        );
    }
    test_field_no_api_hash();
    fn test_field_report_version_mismatch() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).report_version_mismatch) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(report_version_mismatch)
            )
        );
    }
    test_field_report_version_mismatch();
    fn test_field_report_loading_error() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).report_loading_error) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(report_loading_error)
            )
        );
    }
    test_field_report_loading_error();
    fn test_field_gd_native_library() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).gd_native_library) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(gd_native_library)
            )
        );
    }
    test_field_gd_native_library();
    fn test_field_api_struct() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).api_struct) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(api_struct)
            )
        );
    }
    test_field_api_struct();
    fn test_field_active_library_path() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_init_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).active_library_path) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_init_options),
                "::",
                stringify!(active_library_path)
            )
        );
    }
    test_field_active_library_path();
}
impl Default for godot_gdnative_init_options {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_gdnative_terminate_options {
    pub in_editor: godot_bool,
}
#[test]
fn bindgen_test_layout_godot_gdnative_terminate_options() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_terminate_options>(),
        1usize,
        concat!("Size of: ", stringify!(godot_gdnative_terminate_options))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_terminate_options>(),
        1usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_terminate_options)
        )
    );
    fn test_field_in_editor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_terminate_options>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).in_editor) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_terminate_options),
                "::",
                stringify!(in_editor)
            )
        );
    }
    test_field_in_editor();
}
pub type godot_class_constructor =
    ::std::option::Option<unsafe extern "C" fn() -> *mut godot_object>;
#[doc = " GDNative procedure types"]
pub type godot_gdnative_init_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut godot_gdnative_init_options)>;
pub type godot_gdnative_terminate_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut godot_gdnative_terminate_options)>;
pub type godot_gdnative_procedure_fn =
    ::std::option::Option<unsafe extern "C" fn(arg1: *mut godot_array) -> godot_variant>;
#[doc = " System Functions"]
pub type native_call_cb = ::std::option::Option<
    unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: *mut godot_array) -> godot_variant,
>;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_arvr_interface_gdnative {
    pub version: godot_gdnative_api_version,
    pub constructor:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut godot_object) -> *mut libc::c_void>,
    pub destructor: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub get_name:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_string>,
    pub get_capabilities:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub get_anchor_detection_is_enabled:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_bool>,
    pub set_anchor_detection_is_enabled:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_bool)>,
    pub is_stereo:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_bool>,
    pub is_initialized:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_bool>,
    pub initialize:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> godot_bool>,
    pub uninitialize: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub get_render_targetsize:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_vector2>,
    pub get_transform_for_eye: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: godot_int,
            arg3: *mut godot_transform,
        ) -> godot_transform,
    >,
    pub fill_projection_for_eye: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *mut godot_real,
            arg3: godot_int,
            arg4: godot_real,
            arg5: godot_real,
            arg6: godot_real,
        ),
    >,
    pub commit_for_eye: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: godot_int,
            arg3: *mut godot_rid,
            arg4: *mut godot_rect2,
        ),
    >,
    pub process: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub get_external_texture_for_eye: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_int) -> godot_int,
    >,
    pub notification:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_int)>,
    pub get_camera_feed_id:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> godot_int>,
}
#[test]
fn bindgen_test_layout_godot_arvr_interface_gdnative() {
    assert_eq!(
        ::std::mem::size_of::<godot_arvr_interface_gdnative>(),
        152usize,
        concat!("Size of: ", stringify!(godot_arvr_interface_gdnative))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_arvr_interface_gdnative>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_arvr_interface_gdnative))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_constructor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).constructor) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(constructor)
            )
        );
    }
    test_field_constructor();
    fn test_field_destructor() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).destructor) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(destructor)
            )
        );
    }
    test_field_destructor();
    fn test_field_get_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_name) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(get_name)
            )
        );
    }
    test_field_get_name();
    fn test_field_get_capabilities() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_capabilities) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(get_capabilities)
            )
        );
    }
    test_field_get_capabilities();
    fn test_field_get_anchor_detection_is_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_anchor_detection_is_enabled) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(get_anchor_detection_is_enabled)
            )
        );
    }
    test_field_get_anchor_detection_is_enabled();
    fn test_field_set_anchor_detection_is_enabled() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_anchor_detection_is_enabled) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(set_anchor_detection_is_enabled)
            )
        );
    }
    test_field_set_anchor_detection_is_enabled();
    fn test_field_is_stereo() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).is_stereo) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(is_stereo)
            )
        );
    }
    test_field_is_stereo();
    fn test_field_is_initialized() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).is_initialized) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(is_initialized)
            )
        );
    }
    test_field_is_initialized();
    fn test_field_initialize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(initialize)
            )
        );
    }
    test_field_initialize();
    fn test_field_uninitialize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).uninitialize) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(uninitialize)
            )
        );
    }
    test_field_uninitialize();
    fn test_field_get_render_targetsize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_render_targetsize) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(get_render_targetsize)
            )
        );
    }
    test_field_get_render_targetsize();
    fn test_field_get_transform_for_eye() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_transform_for_eye) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(get_transform_for_eye)
            )
        );
    }
    test_field_get_transform_for_eye();
    fn test_field_fill_projection_for_eye() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).fill_projection_for_eye) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(fill_projection_for_eye)
            )
        );
    }
    test_field_fill_projection_for_eye();
    fn test_field_commit_for_eye() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).commit_for_eye) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(commit_for_eye)
            )
        );
    }
    test_field_commit_for_eye();
    fn test_field_process() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).process) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(process)
            )
        );
    }
    test_field_process();
    fn test_field_get_external_texture_for_eye() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_external_texture_for_eye) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(get_external_texture_for_eye)
            )
        );
    }
    test_field_get_external_texture_for_eye();
    fn test_field_notification() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).notification) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(notification)
            )
        );
    }
    test_field_notification();
    fn test_field_get_camera_feed_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_arvr_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_camera_feed_id) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_arvr_interface_gdnative),
                "::",
                stringify!(get_camera_feed_id)
            )
        );
    }
    test_field_get_camera_feed_id();
}
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_DISABLED: godot_method_rpc_mode = 0;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_REMOTE: godot_method_rpc_mode = 1;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_MASTER: godot_method_rpc_mode = 2;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_PUPPET: godot_method_rpc_mode = 3;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_SLAVE: godot_method_rpc_mode = 3;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_REMOTESYNC: godot_method_rpc_mode = 4;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_SYNC: godot_method_rpc_mode = 4;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_MASTERSYNC: godot_method_rpc_mode = 5;
pub const godot_method_rpc_mode_GODOT_METHOD_RPC_MODE_PUPPETSYNC: godot_method_rpc_mode = 6;
pub type godot_method_rpc_mode = libc::c_uint;
#[doc = "< no hint provided."]
pub const godot_property_hint_GODOT_PROPERTY_HINT_NONE: godot_property_hint = 0;
#[doc = "< hint_text = \"min,max,step,slider; //slider is optional\""]
pub const godot_property_hint_GODOT_PROPERTY_HINT_RANGE: godot_property_hint = 1;
#[doc = "< hint_text = \"min,max,step\", exponential edit"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_EXP_RANGE: godot_property_hint = 2;
#[doc = "< hint_text= \"val1,val2,val3,etc\""]
pub const godot_property_hint_GODOT_PROPERTY_HINT_ENUM: godot_property_hint = 3;
pub const godot_property_hint_GODOT_PROPERTY_HINT_EXP_EASING: godot_property_hint = 4;
#[doc = "< hint_text= \"length\" (as integer)"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_LENGTH: godot_property_hint = 5;
pub const godot_property_hint_GODOT_PROPERTY_HINT_SPRITE_FRAME: godot_property_hint = 6;
#[doc = "< hint_text= \"length\" (as integer)"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_KEY_ACCEL: godot_property_hint = 7;
#[doc = "< hint_text= \"flag1,flag2,etc\" (as bit flags)"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_FLAGS: godot_property_hint = 8;
pub const godot_property_hint_GODOT_PROPERTY_HINT_LAYERS_2D_RENDER: godot_property_hint = 9;
pub const godot_property_hint_GODOT_PROPERTY_HINT_LAYERS_2D_PHYSICS: godot_property_hint = 10;
pub const godot_property_hint_GODOT_PROPERTY_HINT_LAYERS_3D_RENDER: godot_property_hint = 11;
pub const godot_property_hint_GODOT_PROPERTY_HINT_LAYERS_3D_PHYSICS: godot_property_hint = 12;
#[doc = "< a file path must be passed, hint_text (optionally) is a filter \"*.png,*.wav,*.doc,\""]
pub const godot_property_hint_GODOT_PROPERTY_HINT_FILE: godot_property_hint = 13;
#[doc = "< a directory path must be passed"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_DIR: godot_property_hint = 14;
#[doc = "< a file path must be passed, hint_text (optionally) is a filter \"*.png,*.wav,*.doc,\""]
pub const godot_property_hint_GODOT_PROPERTY_HINT_GLOBAL_FILE: godot_property_hint = 15;
#[doc = "< a directory path must be passed"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_GLOBAL_DIR: godot_property_hint = 16;
#[doc = "< a resource object type"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_RESOURCE_TYPE: godot_property_hint = 17;
#[doc = "< used for string properties that can contain multiple lines"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_MULTILINE_TEXT: godot_property_hint = 18;
#[doc = "< used to set a placeholder text for string properties"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_PLACEHOLDER_TEXT: godot_property_hint = 19;
#[doc = "< used for ignoring alpha component when editing a color"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_COLOR_NO_ALPHA: godot_property_hint = 20;
pub const godot_property_hint_GODOT_PROPERTY_HINT_IMAGE_COMPRESS_LOSSY: godot_property_hint = 21;
pub const godot_property_hint_GODOT_PROPERTY_HINT_IMAGE_COMPRESS_LOSSLESS: godot_property_hint = 22;
pub const godot_property_hint_GODOT_PROPERTY_HINT_OBJECT_ID: godot_property_hint = 23;
#[doc = "< a type string, the hint is the base type to choose"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_TYPE_STRING: godot_property_hint = 24;
#[doc = "< so something else can provide this (used in scripts)"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_NODE_PATH_TO_EDITED_NODE: godot_property_hint =
    25;
#[doc = "< a method of a type"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_METHOD_OF_VARIANT_TYPE: godot_property_hint = 26;
#[doc = "< a method of a base type"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_METHOD_OF_BASE_TYPE: godot_property_hint = 27;
#[doc = "< a method of an instance"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_METHOD_OF_INSTANCE: godot_property_hint = 28;
#[doc = "< a method of a script & base"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_METHOD_OF_SCRIPT: godot_property_hint = 29;
#[doc = "< a property of a type"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_PROPERTY_OF_VARIANT_TYPE: godot_property_hint =
    30;
#[doc = "< a property of a base type"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_PROPERTY_OF_BASE_TYPE: godot_property_hint = 31;
#[doc = "< a property of an instance"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_PROPERTY_OF_INSTANCE: godot_property_hint = 32;
#[doc = "< a property of a script & base"]
pub const godot_property_hint_GODOT_PROPERTY_HINT_PROPERTY_OF_SCRIPT: godot_property_hint = 33;
pub const godot_property_hint_GODOT_PROPERTY_HINT_MAX: godot_property_hint = 34;
pub type godot_property_hint = libc::c_uint;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_STORAGE: godot_property_usage_flags = 1;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_EDITOR: godot_property_usage_flags = 2;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_NETWORK: godot_property_usage_flags = 4;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_EDITOR_HELPER:
    godot_property_usage_flags = 8;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_CHECKABLE: godot_property_usage_flags =
    16;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_CHECKED: godot_property_usage_flags = 32;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_INTERNATIONALIZED:
    godot_property_usage_flags = 64;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_GROUP: godot_property_usage_flags = 128;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_CATEGORY: godot_property_usage_flags =
    256;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_STORE_IF_NONZERO:
    godot_property_usage_flags = 512;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_STORE_IF_NONONE:
    godot_property_usage_flags = 1024;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_NO_INSTANCE_STATE:
    godot_property_usage_flags = 2048;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_RESTART_IF_CHANGED:
    godot_property_usage_flags = 4096;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_SCRIPT_VARIABLE:
    godot_property_usage_flags = 8192;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_STORE_IF_NULL:
    godot_property_usage_flags = 16384;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_ANIMATE_AS_TRIGGER:
    godot_property_usage_flags = 32768;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_UPDATE_ALL_IF_MODIFIED:
    godot_property_usage_flags = 65536;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_DEFAULT: godot_property_usage_flags = 7;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_DEFAULT_INTL: godot_property_usage_flags =
    71;
pub const godot_property_usage_flags_GODOT_PROPERTY_USAGE_NOEDITOR: godot_property_usage_flags = 5;
pub type godot_property_usage_flags = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_property_attributes {
    pub rset_type: godot_method_rpc_mode,
    pub type_: godot_int,
    pub hint: godot_property_hint,
    pub hint_string: godot_string,
    pub usage: godot_property_usage_flags,
    pub default_value: godot_variant,
}
#[test]
fn bindgen_test_layout_godot_property_attributes() {
    assert_eq!(
        ::std::mem::size_of::<godot_property_attributes>(),
        48usize,
        concat!("Size of: ", stringify!(godot_property_attributes))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_property_attributes>(),
        4usize,
        concat!("Alignment of ", stringify!(godot_property_attributes))
    );
    fn test_field_rset_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_attributes>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rset_type) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_attributes),
                "::",
                stringify!(rset_type)
            )
        );
    }
    test_field_rset_type();
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_attributes>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_attributes),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_hint() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_attributes>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_attributes),
                "::",
                stringify!(hint)
            )
        );
    }
    test_field_hint();
    fn test_field_hint_string() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_attributes>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hint_string) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_attributes),
                "::",
                stringify!(hint_string)
            )
        );
    }
    test_field_hint_string();
    fn test_field_usage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_attributes>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize
            },
            20usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_attributes),
                "::",
                stringify!(usage)
            )
        );
    }
    test_field_usage();
    fn test_field_default_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_attributes>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).default_value) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_attributes),
                "::",
                stringify!(default_value)
            )
        );
    }
    test_field_default_value();
}
impl Default for godot_property_attributes {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_instance_create_func {
    pub create_func: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut godot_object, arg2: *mut libc::c_void) -> *mut libc::c_void,
    >,
    pub method_data: *mut libc::c_void,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
}
#[test]
fn bindgen_test_layout_godot_instance_create_func() {
    assert_eq!(
        ::std::mem::size_of::<godot_instance_create_func>(),
        24usize,
        concat!("Size of: ", stringify!(godot_instance_create_func))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_instance_create_func>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_instance_create_func))
    );
    fn test_field_create_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_create_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).create_func) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_create_func),
                "::",
                stringify!(create_func)
            )
        );
    }
    test_field_create_func();
    fn test_field_method_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_create_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).method_data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_create_func),
                "::",
                stringify!(method_data)
            )
        );
    }
    test_field_method_data();
    fn test_field_free_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_create_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_create_func),
                "::",
                stringify!(free_func)
            )
        );
    }
    test_field_free_func();
}
impl Default for godot_instance_create_func {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_instance_destroy_func {
    pub destroy_func: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut godot_object,
            arg2: *mut libc::c_void,
            arg3: *mut libc::c_void,
        ),
    >,
    pub method_data: *mut libc::c_void,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
}
#[test]
fn bindgen_test_layout_godot_instance_destroy_func() {
    assert_eq!(
        ::std::mem::size_of::<godot_instance_destroy_func>(),
        24usize,
        concat!("Size of: ", stringify!(godot_instance_destroy_func))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_instance_destroy_func>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_instance_destroy_func))
    );
    fn test_field_destroy_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_destroy_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).destroy_func) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_destroy_func),
                "::",
                stringify!(destroy_func)
            )
        );
    }
    test_field_destroy_func();
    fn test_field_method_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_destroy_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).method_data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_destroy_func),
                "::",
                stringify!(method_data)
            )
        );
    }
    test_field_method_data();
    fn test_field_free_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_destroy_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_destroy_func),
                "::",
                stringify!(free_func)
            )
        );
    }
    test_field_free_func();
}
impl Default for godot_instance_destroy_func {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_method_attributes {
    pub rpc_type: godot_method_rpc_mode,
}
#[test]
fn bindgen_test_layout_godot_method_attributes() {
    assert_eq!(
        ::std::mem::size_of::<godot_method_attributes>(),
        4usize,
        concat!("Size of: ", stringify!(godot_method_attributes))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_method_attributes>(),
        4usize,
        concat!("Alignment of ", stringify!(godot_method_attributes))
    );
    fn test_field_rpc_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_method_attributes>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).rpc_type) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_method_attributes),
                "::",
                stringify!(rpc_type)
            )
        );
    }
    test_field_rpc_type();
}
impl Default for godot_method_attributes {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_instance_method {
    pub method: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut godot_object,
            arg2: *mut libc::c_void,
            arg3: *mut libc::c_void,
            arg4: libc::c_int,
            arg5: *mut *mut godot_variant,
        ) -> godot_variant,
    >,
    pub method_data: *mut libc::c_void,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
}
#[test]
fn bindgen_test_layout_godot_instance_method() {
    assert_eq!(
        ::std::mem::size_of::<godot_instance_method>(),
        24usize,
        concat!("Size of: ", stringify!(godot_instance_method))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_instance_method>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_instance_method))
    );
    fn test_field_method() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_method>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).method) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_method),
                "::",
                stringify!(method)
            )
        );
    }
    test_field_method();
    fn test_field_method_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_method>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).method_data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_method),
                "::",
                stringify!(method_data)
            )
        );
    }
    test_field_method_data();
    fn test_field_free_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_method>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_method),
                "::",
                stringify!(free_func)
            )
        );
    }
    test_field_free_func();
}
impl Default for godot_instance_method {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_property_set_func {
    pub set_func: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut godot_object,
            arg2: *mut libc::c_void,
            arg3: *mut libc::c_void,
            arg4: *mut godot_variant,
        ),
    >,
    pub method_data: *mut libc::c_void,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
}
#[test]
fn bindgen_test_layout_godot_property_set_func() {
    assert_eq!(
        ::std::mem::size_of::<godot_property_set_func>(),
        24usize,
        concat!("Size of: ", stringify!(godot_property_set_func))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_property_set_func>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_property_set_func))
    );
    fn test_field_set_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_set_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_func) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_set_func),
                "::",
                stringify!(set_func)
            )
        );
    }
    test_field_set_func();
    fn test_field_method_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_set_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).method_data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_set_func),
                "::",
                stringify!(method_data)
            )
        );
    }
    test_field_method_data();
    fn test_field_free_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_set_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_set_func),
                "::",
                stringify!(free_func)
            )
        );
    }
    test_field_free_func();
}
impl Default for godot_property_set_func {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_property_get_func {
    pub get_func: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut godot_object,
            arg2: *mut libc::c_void,
            arg3: *mut libc::c_void,
        ) -> godot_variant,
    >,
    pub method_data: *mut libc::c_void,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
}
#[test]
fn bindgen_test_layout_godot_property_get_func() {
    assert_eq!(
        ::std::mem::size_of::<godot_property_get_func>(),
        24usize,
        concat!("Size of: ", stringify!(godot_property_get_func))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_property_get_func>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_property_get_func))
    );
    fn test_field_get_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_get_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_func) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_get_func),
                "::",
                stringify!(get_func)
            )
        );
    }
    test_field_get_func();
    fn test_field_method_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_get_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).method_data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_get_func),
                "::",
                stringify!(method_data)
            )
        );
    }
    test_field_method_data();
    fn test_field_free_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_property_get_func>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_property_get_func),
                "::",
                stringify!(free_func)
            )
        );
    }
    test_field_free_func();
}
impl Default for godot_property_get_func {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_signal_argument {
    pub name: godot_string,
    pub type_: godot_int,
    pub hint: godot_property_hint,
    pub hint_string: godot_string,
    pub usage: godot_property_usage_flags,
    pub default_value: godot_variant,
}
#[test]
fn bindgen_test_layout_godot_signal_argument() {
    assert_eq!(
        ::std::mem::size_of::<godot_signal_argument>(),
        52usize,
        concat!("Size of: ", stringify!(godot_signal_argument))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_signal_argument>(),
        4usize,
        concat!("Alignment of ", stringify!(godot_signal_argument))
    );
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal_argument>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal_argument),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal_argument>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal_argument),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_hint() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal_argument>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal_argument),
                "::",
                stringify!(hint)
            )
        );
    }
    test_field_hint();
    fn test_field_hint_string() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal_argument>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hint_string) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal_argument),
                "::",
                stringify!(hint_string)
            )
        );
    }
    test_field_hint_string();
    fn test_field_usage() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal_argument>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).usage) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal_argument),
                "::",
                stringify!(usage)
            )
        );
    }
    test_field_usage();
    fn test_field_default_value() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal_argument>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).default_value) as usize - ptr as usize
            },
            28usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal_argument),
                "::",
                stringify!(default_value)
            )
        );
    }
    test_field_default_value();
}
impl Default for godot_signal_argument {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_signal {
    pub name: godot_string,
    pub num_args: libc::c_int,
    pub args: *mut godot_signal_argument,
    pub num_default_args: libc::c_int,
    pub default_args: *mut godot_variant,
}
#[test]
fn bindgen_test_layout_godot_signal() {
    assert_eq!(
        ::std::mem::size_of::<godot_signal>(),
        40usize,
        concat!("Size of: ", stringify!(godot_signal))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_signal>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_signal))
    );
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
    fn test_field_num_args() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).num_args) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal),
                "::",
                stringify!(num_args)
            )
        );
    }
    test_field_num_args();
    fn test_field_args() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).args) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal),
                "::",
                stringify!(args)
            )
        );
    }
    test_field_args();
    fn test_field_num_default_args() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).num_default_args) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal),
                "::",
                stringify!(num_default_args)
            )
        );
    }
    test_field_num_default_args();
    fn test_field_default_args() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_signal>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).default_args) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_signal),
                "::",
                stringify!(default_args)
            )
        );
    }
    test_field_default_args();
}
impl Default for godot_signal {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_method_arg {
    pub name: godot_string,
    pub type_: godot_variant_type,
    pub hint: godot_property_hint,
    pub hint_string: godot_string,
}
#[test]
fn bindgen_test_layout_godot_method_arg() {
    assert_eq!(
        ::std::mem::size_of::<godot_method_arg>(),
        24usize,
        concat!("Size of: ", stringify!(godot_method_arg))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_method_arg>(),
        4usize,
        concat!("Alignment of ", stringify!(godot_method_arg))
    );
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_method_arg>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_method_arg),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_method_arg>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_method_arg),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_hint() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_method_arg>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hint) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_method_arg),
                "::",
                stringify!(hint)
            )
        );
    }
    test_field_hint();
    fn test_field_hint_string() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_method_arg>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).hint_string) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_method_arg),
                "::",
                stringify!(hint_string)
            )
        );
    }
    test_field_hint_string();
}
impl Default for godot_method_arg {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_instance_binding_functions {
    pub alloc_instance_binding_data: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *const libc::c_void,
            arg3: *mut godot_object,
        ) -> *mut libc::c_void,
    >,
    pub free_instance_binding_data: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: *mut libc::c_void),
    >,
    pub refcount_incremented_instance_binding: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: *mut godot_object),
    >,
    pub refcount_decremented_instance_binding: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: *mut godot_object) -> bool,
    >,
    pub data: *mut libc::c_void,
    pub free_func: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
}
#[test]
fn bindgen_test_layout_godot_instance_binding_functions() {
    assert_eq!(
        ::std::mem::size_of::<godot_instance_binding_functions>(),
        48usize,
        concat!("Size of: ", stringify!(godot_instance_binding_functions))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_instance_binding_functions>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_instance_binding_functions)
        )
    );
    fn test_field_alloc_instance_binding_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_binding_functions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).alloc_instance_binding_data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_binding_functions),
                "::",
                stringify!(alloc_instance_binding_data)
            )
        );
    }
    test_field_alloc_instance_binding_data();
    fn test_field_free_instance_binding_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_binding_functions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_instance_binding_data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_binding_functions),
                "::",
                stringify!(free_instance_binding_data)
            )
        );
    }
    test_field_free_instance_binding_data();
    fn test_field_refcount_incremented_instance_binding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_binding_functions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refcount_incremented_instance_binding) as usize
                    - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_binding_functions),
                "::",
                stringify!(refcount_incremented_instance_binding)
            )
        );
    }
    test_field_refcount_incremented_instance_binding();
    fn test_field_refcount_decremented_instance_binding() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_binding_functions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refcount_decremented_instance_binding) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_binding_functions),
                "::",
                stringify!(refcount_decremented_instance_binding)
            )
        );
    }
    test_field_refcount_decremented_instance_binding();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_binding_functions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_binding_functions),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_free_func() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_instance_binding_functions>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).free_func) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_instance_binding_functions),
                "::",
                stringify!(free_func)
            )
        );
    }
    test_field_free_func();
}
impl Default for godot_instance_binding_functions {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_net_stream_peer {
    pub version: godot_gdnative_api_version,
    pub data: *mut godot_object,
    pub get_data: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut libc::c_void,
            p_buffer: *mut u8,
            p_bytes: libc::c_int,
        ) -> godot_error,
    >,
    pub get_partial_data: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut libc::c_void,
            p_buffer: *mut u8,
            p_bytes: libc::c_int,
            r_received: *mut libc::c_int,
        ) -> godot_error,
    >,
    pub put_data: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut libc::c_void,
            p_data: *const u8,
            p_bytes: libc::c_int,
        ) -> godot_error,
    >,
    pub put_partial_data: ::std::option::Option<
        unsafe extern "C" fn(
            user: *mut libc::c_void,
            p_data: *const u8,
            p_bytes: libc::c_int,
            r_sent: *mut libc::c_int,
        ) -> godot_error,
    >,
    pub get_available_bytes:
        ::std::option::Option<unsafe extern "C" fn(user: *const libc::c_void) -> libc::c_int>,
    pub next: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_godot_net_stream_peer() {
    assert_eq!(
        ::std::mem::size_of::<godot_net_stream_peer>(),
        64usize,
        concat!("Size of: ", stringify!(godot_net_stream_peer))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_net_stream_peer>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_net_stream_peer))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_get_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_data) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(get_data)
            )
        );
    }
    test_field_get_data();
    fn test_field_get_partial_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_partial_data) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(get_partial_data)
            )
        );
    }
    test_field_get_partial_data();
    fn test_field_put_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).put_data) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(put_data)
            )
        );
    }
    test_field_put_data();
    fn test_field_put_partial_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).put_partial_data) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(put_partial_data)
            )
        );
    }
    test_field_put_partial_data();
    fn test_field_get_available_bytes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_available_bytes) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(get_available_bytes)
            )
        );
    }
    test_field_get_available_bytes();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_stream_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_stream_peer),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
impl Default for godot_net_stream_peer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_net_packet_peer {
    pub version: godot_gdnative_api_version,
    pub data: *mut godot_object,
    pub get_packet: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *mut *const u8,
            arg3: *mut libc::c_int,
        ) -> godot_error,
    >,
    pub put_packet: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *const u8,
            arg3: libc::c_int,
        ) -> godot_error,
    >,
    pub get_available_packet_count:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub get_max_packet_size:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub next: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_godot_net_packet_peer() {
    assert_eq!(
        ::std::mem::size_of::<godot_net_packet_peer>(),
        56usize,
        concat!("Size of: ", stringify!(godot_net_packet_peer))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_net_packet_peer>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_net_packet_peer))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_packet_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_packet_peer),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_packet_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_packet_peer),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_get_packet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_packet_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_packet) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_packet_peer),
                "::",
                stringify!(get_packet)
            )
        );
    }
    test_field_get_packet();
    fn test_field_put_packet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_packet_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).put_packet) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_packet_peer),
                "::",
                stringify!(put_packet)
            )
        );
    }
    test_field_put_packet();
    fn test_field_get_available_packet_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_packet_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_available_packet_count) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_packet_peer),
                "::",
                stringify!(get_available_packet_count)
            )
        );
    }
    test_field_get_available_packet_count();
    fn test_field_get_max_packet_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_packet_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_max_packet_size) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_packet_peer),
                "::",
                stringify!(get_max_packet_size)
            )
        );
    }
    test_field_get_max_packet_size();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_packet_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_packet_peer),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
impl Default for godot_net_packet_peer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_net_multiplayer_peer {
    pub version: godot_gdnative_api_version,
    pub data: *mut godot_object,
    pub get_packet: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *mut *const u8,
            arg3: *mut libc::c_int,
        ) -> godot_error,
    >,
    pub put_packet: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *const u8,
            arg3: libc::c_int,
        ) -> godot_error,
    >,
    pub get_available_packet_count:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub get_max_packet_size:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub set_transfer_mode:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_int)>,
    pub get_transfer_mode:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub set_target_peer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_int)>,
    pub get_packet_peer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub is_server:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_bool>,
    pub poll: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub get_unique_id:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> i32>,
    pub set_refuse_new_connections:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_bool)>,
    pub is_refusing_new_connections:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_bool>,
    pub get_connection_status:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub next: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_godot_net_multiplayer_peer() {
    assert_eq!(
        ::std::mem::size_of::<godot_net_multiplayer_peer>(),
        136usize,
        concat!("Size of: ", stringify!(godot_net_multiplayer_peer))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_net_multiplayer_peer>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_net_multiplayer_peer))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_get_packet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_packet) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(get_packet)
            )
        );
    }
    test_field_get_packet();
    fn test_field_put_packet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).put_packet) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(put_packet)
            )
        );
    }
    test_field_put_packet();
    fn test_field_get_available_packet_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_available_packet_count) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(get_available_packet_count)
            )
        );
    }
    test_field_get_available_packet_count();
    fn test_field_get_max_packet_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_max_packet_size) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(get_max_packet_size)
            )
        );
    }
    test_field_get_max_packet_size();
    fn test_field_set_transfer_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_transfer_mode) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(set_transfer_mode)
            )
        );
    }
    test_field_set_transfer_mode();
    fn test_field_get_transfer_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_transfer_mode) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(get_transfer_mode)
            )
        );
    }
    test_field_get_transfer_mode();
    fn test_field_set_target_peer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_target_peer) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(set_target_peer)
            )
        );
    }
    test_field_set_target_peer();
    fn test_field_get_packet_peer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_packet_peer) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(get_packet_peer)
            )
        );
    }
    test_field_get_packet_peer();
    fn test_field_is_server() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).is_server) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(is_server)
            )
        );
    }
    test_field_is_server();
    fn test_field_poll() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).poll) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(poll)
            )
        );
    }
    test_field_poll();
    fn test_field_get_unique_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_unique_id) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(get_unique_id)
            )
        );
    }
    test_field_get_unique_id();
    fn test_field_set_refuse_new_connections() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_refuse_new_connections) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(set_refuse_new_connections)
            )
        );
    }
    test_field_set_refuse_new_connections();
    fn test_field_is_refusing_new_connections() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).is_refusing_new_connections) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(is_refusing_new_connections)
            )
        );
    }
    test_field_is_refusing_new_connections();
    fn test_field_get_connection_status() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_connection_status) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(get_connection_status)
            )
        );
    }
    test_field_get_connection_status();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_multiplayer_peer>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_multiplayer_peer),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
impl Default for godot_net_multiplayer_peer {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_net_webrtc_library {
    pub version: godot_gdnative_api_version,
    pub unregistered: ::std::option::Option<unsafe extern "C" fn()>,
    pub create_peer_connection:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut godot_object) -> godot_error>,
    pub next: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_godot_net_webrtc_library() {
    assert_eq!(
        ::std::mem::size_of::<godot_net_webrtc_library>(),
        32usize,
        concat!("Size of: ", stringify!(godot_net_webrtc_library))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_net_webrtc_library>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_net_webrtc_library))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_library>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_library),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_unregistered() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_library>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).unregistered) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_library),
                "::",
                stringify!(unregistered)
            )
        );
    }
    test_field_unregistered();
    fn test_field_create_peer_connection() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_library>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).create_peer_connection) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_library),
                "::",
                stringify!(create_peer_connection)
            )
        );
    }
    test_field_create_peer_connection();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_library>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_library),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
impl Default for godot_net_webrtc_library {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_net_webrtc_peer_connection {
    pub version: godot_gdnative_api_version,
    pub data: *mut godot_object,
    pub get_connection_state:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub initialize: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: *const godot_dictionary) -> godot_error,
    >,
    pub create_data_channel: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            p_channel_name: *const libc::c_char,
            arg2: *const godot_dictionary,
        ) -> *mut godot_object,
    >,
    pub create_offer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> godot_error>,
    pub create_answer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> godot_error>,
    pub set_remote_description: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *const libc::c_char,
            arg3: *const libc::c_char,
        ) -> godot_error,
    >,
    pub set_local_description: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *const libc::c_char,
            arg3: *const libc::c_char,
        ) -> godot_error,
    >,
    pub add_ice_candidate: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *const libc::c_char,
            arg3: libc::c_int,
            arg4: *const libc::c_char,
        ) -> godot_error,
    >,
    pub poll: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> godot_error>,
    pub close: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub next: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_godot_net_webrtc_peer_connection() {
    assert_eq!(
        ::std::mem::size_of::<godot_net_webrtc_peer_connection>(),
        104usize,
        concat!("Size of: ", stringify!(godot_net_webrtc_peer_connection))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_net_webrtc_peer_connection>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_net_webrtc_peer_connection)
        )
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_get_connection_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_connection_state) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(get_connection_state)
            )
        );
    }
    test_field_get_connection_state();
    fn test_field_initialize() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(initialize)
            )
        );
    }
    test_field_initialize();
    fn test_field_create_data_channel() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).create_data_channel) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(create_data_channel)
            )
        );
    }
    test_field_create_data_channel();
    fn test_field_create_offer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).create_offer) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(create_offer)
            )
        );
    }
    test_field_create_offer();
    fn test_field_create_answer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).create_answer) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(create_answer)
            )
        );
    }
    test_field_create_answer();
    fn test_field_set_remote_description() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_remote_description) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(set_remote_description)
            )
        );
    }
    test_field_set_remote_description();
    fn test_field_set_local_description() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_local_description) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(set_local_description)
            )
        );
    }
    test_field_set_local_description();
    fn test_field_add_ice_candidate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).add_ice_candidate) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(add_ice_candidate)
            )
        );
    }
    test_field_add_ice_candidate();
    fn test_field_poll() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).poll) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(poll)
            )
        );
    }
    test_field_poll();
    fn test_field_close() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(close)
            )
        );
    }
    test_field_close();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_peer_connection>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_peer_connection),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
impl Default for godot_net_webrtc_peer_connection {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_net_webrtc_data_channel {
    pub version: godot_gdnative_api_version,
    pub data: *mut godot_object,
    pub get_packet: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *mut *const u8,
            arg3: *mut libc::c_int,
        ) -> godot_error,
    >,
    pub put_packet: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *const u8,
            arg3: libc::c_int,
        ) -> godot_error,
    >,
    pub get_available_packet_count:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub get_max_packet_size:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub set_write_mode:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_int)>,
    pub get_write_mode:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub was_string_packet:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> bool>,
    pub get_ready_state:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub get_label: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const libc::c_void) -> *const libc::c_char,
    >,
    pub is_ordered: ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> bool>,
    pub get_id:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> libc::c_int>,
    pub get_max_packet_life_time:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> libc::c_int>,
    pub get_max_retransmits:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> libc::c_int>,
    pub get_protocol: ::std::option::Option<
        unsafe extern "C" fn(arg1: *const libc::c_void) -> *const libc::c_char,
    >,
    pub is_negotiated:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> bool>,
    pub poll: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void) -> godot_error>,
    pub close: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub next: *mut libc::c_void,
}
#[test]
fn bindgen_test_layout_godot_net_webrtc_data_channel() {
    assert_eq!(
        ::std::mem::size_of::<godot_net_webrtc_data_channel>(),
        160usize,
        concat!("Size of: ", stringify!(godot_net_webrtc_data_channel))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_net_webrtc_data_channel>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_net_webrtc_data_channel))
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_get_packet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_packet) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_packet)
            )
        );
    }
    test_field_get_packet();
    fn test_field_put_packet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).put_packet) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(put_packet)
            )
        );
    }
    test_field_put_packet();
    fn test_field_get_available_packet_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_available_packet_count) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_available_packet_count)
            )
        );
    }
    test_field_get_available_packet_count();
    fn test_field_get_max_packet_size() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_max_packet_size) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_max_packet_size)
            )
        );
    }
    test_field_get_max_packet_size();
    fn test_field_set_write_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_write_mode) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(set_write_mode)
            )
        );
    }
    test_field_set_write_mode();
    fn test_field_get_write_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_write_mode) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_write_mode)
            )
        );
    }
    test_field_get_write_mode();
    fn test_field_was_string_packet() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).was_string_packet) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(was_string_packet)
            )
        );
    }
    test_field_was_string_packet();
    fn test_field_get_ready_state() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_ready_state) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_ready_state)
            )
        );
    }
    test_field_get_ready_state();
    fn test_field_get_label() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_label) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_label)
            )
        );
    }
    test_field_get_label();
    fn test_field_is_ordered() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).is_ordered) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(is_ordered)
            )
        );
    }
    test_field_is_ordered();
    fn test_field_get_id() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_id) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_id)
            )
        );
    }
    test_field_get_id();
    fn test_field_get_max_packet_life_time() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_max_packet_life_time) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_max_packet_life_time)
            )
        );
    }
    test_field_get_max_packet_life_time();
    fn test_field_get_max_retransmits() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_max_retransmits) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_max_retransmits)
            )
        );
    }
    test_field_get_max_retransmits();
    fn test_field_get_protocol() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_protocol) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(get_protocol)
            )
        );
    }
    test_field_get_protocol();
    fn test_field_is_negotiated() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).is_negotiated) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(is_negotiated)
            )
        );
    }
    test_field_is_negotiated();
    fn test_field_poll() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).poll) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(poll)
            )
        );
    }
    test_field_poll();
    fn test_field_close() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).close) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(close)
            )
        );
    }
    test_field_close();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_net_webrtc_data_channel>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_net_webrtc_data_channel),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
}
impl Default for godot_net_webrtc_data_channel {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type godot_pluginscript_instance_data = libc::c_void;
pub type godot_pluginscript_script_data = libc::c_void;
pub type godot_pluginscript_language_data = libc::c_void;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pluginscript_instance_desc {
    pub init: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_script_data,
            p_owner: *mut godot_object,
        ) -> *mut godot_pluginscript_instance_data,
    >,
    pub finish:
        ::std::option::Option<unsafe extern "C" fn(p_data: *mut godot_pluginscript_instance_data)>,
    pub set_prop: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_instance_data,
            p_name: *const godot_string,
            p_value: *const godot_variant,
        ) -> godot_bool,
    >,
    pub get_prop: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_instance_data,
            p_name: *const godot_string,
            r_ret: *mut godot_variant,
        ) -> godot_bool,
    >,
    pub call_method: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_instance_data,
            p_method: *const godot_string_name,
            p_args: *mut *const godot_variant,
            p_argcount: libc::c_int,
            r_error: *mut godot_variant_call_error,
        ) -> godot_variant,
    >,
    pub notification: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_instance_data,
            p_notification: libc::c_int,
        ),
    >,
    pub get_rpc_mode: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_instance_data,
            p_method: *const godot_string,
        ) -> godot_method_rpc_mode,
    >,
    pub get_rset_mode: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_instance_data,
            p_variable: *const godot_string,
        ) -> godot_method_rpc_mode,
    >,
    pub refcount_incremented:
        ::std::option::Option<unsafe extern "C" fn(p_data: *mut godot_pluginscript_instance_data)>,
    pub refcount_decremented: ::std::option::Option<
        unsafe extern "C" fn(p_data: *mut godot_pluginscript_instance_data) -> bool,
    >,
}
#[test]
fn bindgen_test_layout_godot_pluginscript_instance_desc() {
    assert_eq!(
        ::std::mem::size_of::<godot_pluginscript_instance_desc>(),
        80usize,
        concat!("Size of: ", stringify!(godot_pluginscript_instance_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pluginscript_instance_desc>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_pluginscript_instance_desc)
        )
    );
    fn test_field_init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(init)
            )
        );
    }
    test_field_init();
    fn test_field_finish() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).finish) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(finish)
            )
        );
    }
    test_field_finish();
    fn test_field_set_prop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_prop) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(set_prop)
            )
        );
    }
    test_field_set_prop();
    fn test_field_get_prop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_prop) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(get_prop)
            )
        );
    }
    test_field_get_prop();
    fn test_field_call_method() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).call_method) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(call_method)
            )
        );
    }
    test_field_call_method();
    fn test_field_notification() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).notification) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(notification)
            )
        );
    }
    test_field_notification();
    fn test_field_get_rpc_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_rpc_mode) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(get_rpc_mode)
            )
        );
    }
    test_field_get_rpc_mode();
    fn test_field_get_rset_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_rset_mode) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(get_rset_mode)
            )
        );
    }
    test_field_get_rset_mode();
    fn test_field_refcount_incremented() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refcount_incremented) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(refcount_incremented)
            )
        );
    }
    test_field_refcount_incremented();
    fn test_field_refcount_decremented() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_instance_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).refcount_decremented) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_instance_desc),
                "::",
                stringify!(refcount_decremented)
            )
        );
    }
    test_field_refcount_decremented();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_pluginscript_script_manifest {
    pub data: *mut godot_pluginscript_script_data,
    pub name: godot_string_name,
    pub is_tool: godot_bool,
    pub base: godot_string_name,
    pub member_lines: godot_dictionary,
    pub methods: godot_array,
    pub signals: godot_array,
    pub properties: godot_array,
}
#[test]
fn bindgen_test_layout_godot_pluginscript_script_manifest() {
    assert_eq!(
        ::std::mem::size_of::<godot_pluginscript_script_manifest>(),
        64usize,
        concat!("Size of: ", stringify!(godot_pluginscript_script_manifest))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pluginscript_script_manifest>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_pluginscript_script_manifest)
        )
    );
    fn test_field_data() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(data)
            )
        );
    }
    test_field_data();
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
    fn test_field_is_tool() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).is_tool) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(is_tool)
            )
        );
    }
    test_field_is_tool();
    fn test_field_base() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).base) as usize - ptr as usize
            },
            17usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(base)
            )
        );
    }
    test_field_base();
    fn test_field_member_lines() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).member_lines) as usize - ptr as usize
            },
            25usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(member_lines)
            )
        );
    }
    test_field_member_lines();
    fn test_field_methods() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).methods) as usize - ptr as usize
            },
            33usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(methods)
            )
        );
    }
    test_field_methods();
    fn test_field_signals() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).signals) as usize - ptr as usize
            },
            41usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(signals)
            )
        );
    }
    test_field_signals();
    fn test_field_properties() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_pluginscript_script_manifest>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).properties) as usize - ptr as usize
            },
            49usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_manifest),
                "::",
                stringify!(properties)
            )
        );
    }
    test_field_properties();
}
impl Default for godot_pluginscript_script_manifest {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pluginscript_script_desc {
    pub init: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_path: *const godot_string,
            p_source: *const godot_string,
            r_error: *mut godot_error,
        ) -> godot_pluginscript_script_manifest,
    >,
    pub finish:
        ::std::option::Option<unsafe extern "C" fn(p_data: *mut godot_pluginscript_script_data)>,
    pub instance_desc: godot_pluginscript_instance_desc,
}
#[test]
fn bindgen_test_layout_godot_pluginscript_script_desc() {
    assert_eq!(
        ::std::mem::size_of::<godot_pluginscript_script_desc>(),
        96usize,
        concat!("Size of: ", stringify!(godot_pluginscript_script_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pluginscript_script_desc>(),
        8usize,
        concat!("Alignment of ", stringify!(godot_pluginscript_script_desc))
    );
    fn test_field_init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_script_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_desc),
                "::",
                stringify!(init)
            )
        );
    }
    test_field_init();
    fn test_field_finish() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_script_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).finish) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_desc),
                "::",
                stringify!(finish)
            )
        );
    }
    test_field_finish();
    fn test_field_instance_desc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_script_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).instance_desc) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_script_desc),
                "::",
                stringify!(instance_desc)
            )
        );
    }
    test_field_instance_desc();
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct godot_pluginscript_profiling_data {
    pub signature: godot_string_name,
    pub call_count: godot_int,
    pub total_time: godot_int,
    pub self_time: godot_int,
}
#[test]
fn bindgen_test_layout_godot_pluginscript_profiling_data() {
    assert_eq!(
        ::std::mem::size_of::<godot_pluginscript_profiling_data>(),
        20usize,
        concat!("Size of: ", stringify!(godot_pluginscript_profiling_data))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pluginscript_profiling_data>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(godot_pluginscript_profiling_data)
        )
    );
    fn test_field_signature() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_profiling_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).signature) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_profiling_data),
                "::",
                stringify!(signature)
            )
        );
    }
    test_field_signature();
    fn test_field_call_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_profiling_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).call_count) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_profiling_data),
                "::",
                stringify!(call_count)
            )
        );
    }
    test_field_call_count();
    fn test_field_total_time() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_profiling_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).total_time) as usize - ptr as usize
            },
            12usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_profiling_data),
                "::",
                stringify!(total_time)
            )
        );
    }
    test_field_total_time();
    fn test_field_self_time() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_profiling_data>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).self_time) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_profiling_data),
                "::",
                stringify!(self_time)
            )
        );
    }
    test_field_self_time();
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_pluginscript_language_desc {
    pub name: *const libc::c_char,
    pub type_: *const libc::c_char,
    pub extension: *const libc::c_char,
    pub recognized_extensions: *mut *const libc::c_char,
    pub init:
        ::std::option::Option<unsafe extern "C" fn() -> *mut godot_pluginscript_language_data>,
    pub finish:
        ::std::option::Option<unsafe extern "C" fn(p_data: *mut godot_pluginscript_language_data)>,
    pub reserved_words: *mut *const libc::c_char,
    pub comment_delimiters: *mut *const libc::c_char,
    pub string_delimiters: *mut *const libc::c_char,
    pub has_named_classes: godot_bool,
    pub supports_builtin_mode: godot_bool,
    pub get_template_source_code: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_class_name: *const godot_string,
            p_base_class_name: *const godot_string,
        ) -> godot_string,
    >,
    pub validate: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_script: *const godot_string,
            r_line_error: *mut libc::c_int,
            r_col_error: *mut libc::c_int,
            r_test_error: *mut godot_string,
            p_path: *const godot_string,
            r_functions: *mut godot_pool_string_array,
        ) -> godot_bool,
    >,
    pub find_function: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_function: *const godot_string,
            p_code: *const godot_string,
        ) -> libc::c_int,
    >,
    pub make_function: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_class: *const godot_string,
            p_name: *const godot_string,
            p_args: *const godot_pool_string_array,
        ) -> godot_string,
    >,
    pub complete_code: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_code: *const godot_string,
            p_path: *const godot_string,
            p_owner: *mut godot_object,
            r_options: *mut godot_array,
            r_force: *mut godot_bool,
            r_call_hint: *mut godot_string,
        ) -> godot_error,
    >,
    pub auto_indent_code: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_code: *mut godot_string,
            p_from_line: libc::c_int,
            p_to_line: libc::c_int,
        ),
    >,
    pub add_global_constant: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_variable: *const godot_string,
            p_value: *const godot_variant,
        ),
    >,
    pub debug_get_error: ::std::option::Option<
        unsafe extern "C" fn(p_data: *mut godot_pluginscript_language_data) -> godot_string,
    >,
    pub debug_get_stack_level_count: ::std::option::Option<
        unsafe extern "C" fn(p_data: *mut godot_pluginscript_language_data) -> libc::c_int,
    >,
    pub debug_get_stack_level_line: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_level: libc::c_int,
        ) -> libc::c_int,
    >,
    pub debug_get_stack_level_function: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_level: libc::c_int,
        ) -> godot_string,
    >,
    pub debug_get_stack_level_source: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_level: libc::c_int,
        ) -> godot_string,
    >,
    pub debug_get_stack_level_locals: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_level: libc::c_int,
            p_locals: *mut godot_pool_string_array,
            p_values: *mut godot_array,
            p_max_subitems: libc::c_int,
            p_max_depth: libc::c_int,
        ),
    >,
    pub debug_get_stack_level_members: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_level: libc::c_int,
            p_members: *mut godot_pool_string_array,
            p_values: *mut godot_array,
            p_max_subitems: libc::c_int,
            p_max_depth: libc::c_int,
        ),
    >,
    pub debug_get_globals: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_locals: *mut godot_pool_string_array,
            p_values: *mut godot_array,
            p_max_subitems: libc::c_int,
            p_max_depth: libc::c_int,
        ),
    >,
    pub debug_parse_stack_level_expression: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            p_level: libc::c_int,
            p_expression: *const godot_string,
            p_max_subitems: libc::c_int,
            p_max_depth: libc::c_int,
        ) -> godot_string,
    >,
    pub get_public_functions: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            r_functions: *mut godot_array,
        ),
    >,
    pub get_public_constants: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            r_constants: *mut godot_dictionary,
        ),
    >,
    pub profiling_start:
        ::std::option::Option<unsafe extern "C" fn(p_data: *mut godot_pluginscript_language_data)>,
    pub profiling_stop:
        ::std::option::Option<unsafe extern "C" fn(p_data: *mut godot_pluginscript_language_data)>,
    pub profiling_get_accumulated_data: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            r_info: *mut godot_pluginscript_profiling_data,
            p_info_max: libc::c_int,
        ) -> libc::c_int,
    >,
    pub profiling_get_frame_data: ::std::option::Option<
        unsafe extern "C" fn(
            p_data: *mut godot_pluginscript_language_data,
            r_info: *mut godot_pluginscript_profiling_data,
            p_info_max: libc::c_int,
        ) -> libc::c_int,
    >,
    pub profiling_frame:
        ::std::option::Option<unsafe extern "C" fn(p_data: *mut godot_pluginscript_language_data)>,
    pub script_desc: godot_pluginscript_script_desc,
}
#[test]
fn bindgen_test_layout_godot_pluginscript_language_desc() {
    assert_eq!(
        ::std::mem::size_of::<godot_pluginscript_language_desc>(),
        360usize,
        concat!("Size of: ", stringify!(godot_pluginscript_language_desc))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_pluginscript_language_desc>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_pluginscript_language_desc)
        )
    );
    fn test_field_name() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(name)
            )
        );
    }
    test_field_name();
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_extension() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).extension) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(extension)
            )
        );
    }
    test_field_extension();
    fn test_field_recognized_extensions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).recognized_extensions) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(recognized_extensions)
            )
        );
    }
    test_field_recognized_extensions();
    fn test_field_init() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).init) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(init)
            )
        );
    }
    test_field_init();
    fn test_field_finish() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).finish) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(finish)
            )
        );
    }
    test_field_finish();
    fn test_field_reserved_words() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).reserved_words) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(reserved_words)
            )
        );
    }
    test_field_reserved_words();
    fn test_field_comment_delimiters() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).comment_delimiters) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(comment_delimiters)
            )
        );
    }
    test_field_comment_delimiters();
    fn test_field_string_delimiters() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).string_delimiters) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(string_delimiters)
            )
        );
    }
    test_field_string_delimiters();
    fn test_field_has_named_classes() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).has_named_classes) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(has_named_classes)
            )
        );
    }
    test_field_has_named_classes();
    fn test_field_supports_builtin_mode() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).supports_builtin_mode) as usize - ptr as usize
            },
            73usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(supports_builtin_mode)
            )
        );
    }
    test_field_supports_builtin_mode();
    fn test_field_get_template_source_code() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_template_source_code) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(get_template_source_code)
            )
        );
    }
    test_field_get_template_source_code();
    fn test_field_validate() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).validate) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(validate)
            )
        );
    }
    test_field_validate();
    fn test_field_find_function() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).find_function) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(find_function)
            )
        );
    }
    test_field_find_function();
    fn test_field_make_function() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).make_function) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(make_function)
            )
        );
    }
    test_field_make_function();
    fn test_field_complete_code() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).complete_code) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(complete_code)
            )
        );
    }
    test_field_complete_code();
    fn test_field_auto_indent_code() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).auto_indent_code) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(auto_indent_code)
            )
        );
    }
    test_field_auto_indent_code();
    fn test_field_add_global_constant() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).add_global_constant) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(add_global_constant)
            )
        );
    }
    test_field_add_global_constant();
    fn test_field_debug_get_error() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_error) as usize - ptr as usize
            },
            136usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_error)
            )
        );
    }
    test_field_debug_get_error();
    fn test_field_debug_get_stack_level_count() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_stack_level_count) as usize - ptr as usize
            },
            144usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_stack_level_count)
            )
        );
    }
    test_field_debug_get_stack_level_count();
    fn test_field_debug_get_stack_level_line() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_stack_level_line) as usize - ptr as usize
            },
            152usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_stack_level_line)
            )
        );
    }
    test_field_debug_get_stack_level_line();
    fn test_field_debug_get_stack_level_function() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_stack_level_function) as usize - ptr as usize
            },
            160usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_stack_level_function)
            )
        );
    }
    test_field_debug_get_stack_level_function();
    fn test_field_debug_get_stack_level_source() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_stack_level_source) as usize - ptr as usize
            },
            168usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_stack_level_source)
            )
        );
    }
    test_field_debug_get_stack_level_source();
    fn test_field_debug_get_stack_level_locals() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_stack_level_locals) as usize - ptr as usize
            },
            176usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_stack_level_locals)
            )
        );
    }
    test_field_debug_get_stack_level_locals();
    fn test_field_debug_get_stack_level_members() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_stack_level_members) as usize - ptr as usize
            },
            184usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_stack_level_members)
            )
        );
    }
    test_field_debug_get_stack_level_members();
    fn test_field_debug_get_globals() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_get_globals) as usize - ptr as usize
            },
            192usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_get_globals)
            )
        );
    }
    test_field_debug_get_globals();
    fn test_field_debug_parse_stack_level_expression() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).debug_parse_stack_level_expression) as usize
                    - ptr as usize
            },
            200usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(debug_parse_stack_level_expression)
            )
        );
    }
    test_field_debug_parse_stack_level_expression();
    fn test_field_get_public_functions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_public_functions) as usize - ptr as usize
            },
            208usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(get_public_functions)
            )
        );
    }
    test_field_get_public_functions();
    fn test_field_get_public_constants() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_public_constants) as usize - ptr as usize
            },
            216usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(get_public_constants)
            )
        );
    }
    test_field_get_public_constants();
    fn test_field_profiling_start() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).profiling_start) as usize - ptr as usize
            },
            224usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(profiling_start)
            )
        );
    }
    test_field_profiling_start();
    fn test_field_profiling_stop() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).profiling_stop) as usize - ptr as usize
            },
            232usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(profiling_stop)
            )
        );
    }
    test_field_profiling_stop();
    fn test_field_profiling_get_accumulated_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).profiling_get_accumulated_data) as usize - ptr as usize
            },
            240usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(profiling_get_accumulated_data)
            )
        );
    }
    test_field_profiling_get_accumulated_data();
    fn test_field_profiling_get_frame_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).profiling_get_frame_data) as usize - ptr as usize
            },
            248usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(profiling_get_frame_data)
            )
        );
    }
    test_field_profiling_get_frame_data();
    fn test_field_profiling_frame() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).profiling_frame) as usize - ptr as usize
            },
            256usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(profiling_frame)
            )
        );
    }
    test_field_profiling_frame();
    fn test_field_script_desc() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_pluginscript_language_desc>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).script_desc) as usize - ptr as usize
            },
            264usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_pluginscript_language_desc),
                "::",
                stringify!(script_desc)
            )
        );
    }
    test_field_script_desc();
}
impl Default for godot_pluginscript_language_desc {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_videodecoder_interface_gdnative {
    pub version: godot_gdnative_api_version,
    pub next: *mut libc::c_void,
    pub constructor:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut godot_object) -> *mut libc::c_void>,
    pub destructor: ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void)>,
    pub get_plugin_name: ::std::option::Option<unsafe extern "C" fn() -> *const libc::c_char>,
    pub get_supported_extensions: ::std::option::Option<
        unsafe extern "C" fn(count: *mut libc::c_int) -> *mut *const libc::c_char,
    >,
    pub open_file: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: *mut libc::c_void) -> godot_bool,
    >,
    pub get_length:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_real>,
    pub get_playback_position:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_real>,
    pub seek:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_real)>,
    pub set_audio_track:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_int)>,
    pub update:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut libc::c_void, arg2: godot_real)>,
    pub get_videoframe: ::std::option::Option<
        unsafe extern "C" fn(arg1: *mut libc::c_void) -> *mut godot_pool_byte_array,
    >,
    pub get_audioframe: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: *mut libc::c_void,
            arg2: *mut f32,
            arg3: libc::c_int,
        ) -> godot_int,
    >,
    pub get_channels:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub get_mix_rate:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_int>,
    pub get_texture_size:
        ::std::option::Option<unsafe extern "C" fn(arg1: *const libc::c_void) -> godot_vector2>,
}
#[test]
fn bindgen_test_layout_godot_videodecoder_interface_gdnative() {
    assert_eq!(
        ::std::mem::size_of::<godot_videodecoder_interface_gdnative>(),
        136usize,
        concat!(
            "Size of: ",
            stringify!(godot_videodecoder_interface_gdnative)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<godot_videodecoder_interface_gdnative>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_videodecoder_interface_gdnative)
        )
    );
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            8usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_constructor() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).constructor) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(constructor)
            )
        );
    }
    test_field_constructor();
    fn test_field_destructor() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).destructor) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(destructor)
            )
        );
    }
    test_field_destructor();
    fn test_field_get_plugin_name() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_plugin_name) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_plugin_name)
            )
        );
    }
    test_field_get_plugin_name();
    fn test_field_get_supported_extensions() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_supported_extensions) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_supported_extensions)
            )
        );
    }
    test_field_get_supported_extensions();
    fn test_field_open_file() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).open_file) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(open_file)
            )
        );
    }
    test_field_open_file();
    fn test_field_get_length() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_length) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_length)
            )
        );
    }
    test_field_get_length();
    fn test_field_get_playback_position() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_playback_position) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_playback_position)
            )
        );
    }
    test_field_get_playback_position();
    fn test_field_seek() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).seek) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(seek)
            )
        );
    }
    test_field_seek();
    fn test_field_set_audio_track() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).set_audio_track) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(set_audio_track)
            )
        );
    }
    test_field_set_audio_track();
    fn test_field_update() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).update) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(update)
            )
        );
    }
    test_field_update();
    fn test_field_get_videoframe() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_videoframe) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_videoframe)
            )
        );
    }
    test_field_get_videoframe();
    fn test_field_get_audioframe() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_audioframe) as usize - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_audioframe)
            )
        );
    }
    test_field_get_audioframe();
    fn test_field_get_channels() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_channels) as usize - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_channels)
            )
        );
    }
    test_field_get_channels();
    fn test_field_get_mix_rate() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_mix_rate) as usize - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_mix_rate)
            )
        );
    }
    test_field_get_mix_rate();
    fn test_field_get_texture_size() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_videodecoder_interface_gdnative>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).get_texture_size) as usize - ptr as usize
            },
            128usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_videodecoder_interface_gdnative),
                "::",
                stringify!(get_texture_size)
            )
        );
    }
    test_field_get_texture_size();
}
impl Default for godot_videodecoder_interface_gdnative {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const GDNATIVE_API_TYPES_GDNATIVE_CORE: GDNATIVE_API_TYPES = 0;
pub const GDNATIVE_API_TYPES_GDNATIVE_EXT_NATIVESCRIPT: GDNATIVE_API_TYPES = 1;
pub const GDNATIVE_API_TYPES_GDNATIVE_EXT_PLUGINSCRIPT: GDNATIVE_API_TYPES = 2;
pub const GDNATIVE_API_TYPES_GDNATIVE_EXT_ANDROID: GDNATIVE_API_TYPES = 3;
pub const GDNATIVE_API_TYPES_GDNATIVE_EXT_ARVR: GDNATIVE_API_TYPES = 4;
pub const GDNATIVE_API_TYPES_GDNATIVE_EXT_VIDEODECODER: GDNATIVE_API_TYPES = 5;
pub const GDNATIVE_API_TYPES_GDNATIVE_EXT_NET: GDNATIVE_API_TYPES = 6;
pub type GDNATIVE_API_TYPES = libc::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_nativescript_1_1_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_nativescript_set_method_argument_information: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_function_name: *const libc::c_char,
            p_num_args: libc::c_int,
            p_args: *const godot_method_arg,
        ),
    >,
    pub godot_nativescript_set_class_documentation: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_documentation: godot_string,
        ),
    >,
    pub godot_nativescript_set_method_documentation: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_function_name: *const libc::c_char,
            p_documentation: godot_string,
        ),
    >,
    pub godot_nativescript_set_property_documentation: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_path: *const libc::c_char,
            p_documentation: godot_string,
        ),
    >,
    pub godot_nativescript_set_signal_documentation: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_signal_name: *const libc::c_char,
            p_documentation: godot_string,
        ),
    >,
    pub godot_nativescript_set_global_type_tag: ::std::option::Option<
        unsafe extern "C" fn(
            p_idx: libc::c_int,
            p_name: *const libc::c_char,
            p_type_tag: *const libc::c_void,
        ),
    >,
    pub godot_nativescript_get_global_type_tag: ::std::option::Option<
        unsafe extern "C" fn(
            p_idx: libc::c_int,
            p_name: *const libc::c_char,
        ) -> *const libc::c_void,
    >,
    pub godot_nativescript_set_type_tag: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_type_tag: *const libc::c_void,
        ),
    >,
    pub godot_nativescript_get_type_tag: ::std::option::Option<
        unsafe extern "C" fn(p_object: *const godot_object) -> *const libc::c_void,
    >,
    pub godot_nativescript_register_instance_binding_data_functions: ::std::option::Option<
        unsafe extern "C" fn(p_binding_functions: godot_instance_binding_functions) -> libc::c_int,
    >,
    pub godot_nativescript_unregister_instance_binding_data_functions:
        ::std::option::Option<unsafe extern "C" fn(p_idx: libc::c_int)>,
    pub godot_nativescript_get_instance_binding_data: ::std::option::Option<
        unsafe extern "C" fn(p_idx: libc::c_int, p_object: *mut godot_object) -> *mut libc::c_void,
    >,
    pub godot_nativescript_profiling_add_data:
        ::std::option::Option<unsafe extern "C" fn(p_signature: *const libc::c_char, p_line: u64)>,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_nativescript_1_1_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_nativescript_1_1_api_struct>(),
        128usize,
        concat!(
            "Size of: ",
            stringify!(godot_gdnative_ext_nativescript_1_1_api_struct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_nativescript_1_1_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_nativescript_1_1_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_nativescript_set_method_argument_information() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_set_method_argument_information)
                    as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_set_method_argument_information)
            )
        );
    }
    test_field_godot_nativescript_set_method_argument_information();
    fn test_field_godot_nativescript_set_class_documentation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_set_class_documentation) as usize
                    - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_set_class_documentation)
            )
        );
    }
    test_field_godot_nativescript_set_class_documentation();
    fn test_field_godot_nativescript_set_method_documentation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_set_method_documentation) as usize
                    - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_set_method_documentation)
            )
        );
    }
    test_field_godot_nativescript_set_method_documentation();
    fn test_field_godot_nativescript_set_property_documentation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_set_property_documentation) as usize
                    - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_set_property_documentation)
            )
        );
    }
    test_field_godot_nativescript_set_property_documentation();
    fn test_field_godot_nativescript_set_signal_documentation() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_set_signal_documentation) as usize
                    - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_set_signal_documentation)
            )
        );
    }
    test_field_godot_nativescript_set_signal_documentation();
    fn test_field_godot_nativescript_set_global_type_tag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_set_global_type_tag) as usize
                    - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_set_global_type_tag)
            )
        );
    }
    test_field_godot_nativescript_set_global_type_tag();
    fn test_field_godot_nativescript_get_global_type_tag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_get_global_type_tag) as usize
                    - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_get_global_type_tag)
            )
        );
    }
    test_field_godot_nativescript_get_global_type_tag();
    fn test_field_godot_nativescript_set_type_tag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_set_type_tag) as usize - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_set_type_tag)
            )
        );
    }
    test_field_godot_nativescript_set_type_tag();
    fn test_field_godot_nativescript_get_type_tag() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_get_type_tag) as usize - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_get_type_tag)
            )
        );
    }
    test_field_godot_nativescript_get_type_tag();
    fn test_field_godot_nativescript_register_instance_binding_data_functions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!(
                    (*ptr).godot_nativescript_register_instance_binding_data_functions
                ) as usize
                    - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_register_instance_binding_data_functions)
            )
        );
    }
    test_field_godot_nativescript_register_instance_binding_data_functions();
    fn test_field_godot_nativescript_unregister_instance_binding_data_functions() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!(
                    (*ptr).godot_nativescript_unregister_instance_binding_data_functions
                ) as usize
                    - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_unregister_instance_binding_data_functions)
            )
        );
    }
    test_field_godot_nativescript_unregister_instance_binding_data_functions();
    fn test_field_godot_nativescript_get_instance_binding_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_get_instance_binding_data) as usize
                    - ptr as usize
            },
            112usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_get_instance_binding_data)
            )
        );
    }
    test_field_godot_nativescript_get_instance_binding_data();
    fn test_field_godot_nativescript_profiling_add_data() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<
                    godot_gdnative_ext_nativescript_1_1_api_struct,
                >::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_profiling_add_data) as usize
                    - ptr as usize
            },
            120usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_1_1_api_struct),
                "::",
                stringify!(godot_nativescript_profiling_add_data)
            )
        );
    }
    test_field_godot_nativescript_profiling_add_data();
}
impl Default for godot_gdnative_ext_nativescript_1_1_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_nativescript_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_nativescript_register_class: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_base: *const libc::c_char,
            p_create_func: godot_instance_create_func,
            p_destroy_func: godot_instance_destroy_func,
        ),
    >,
    pub godot_nativescript_register_tool_class: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_base: *const libc::c_char,
            p_create_func: godot_instance_create_func,
            p_destroy_func: godot_instance_destroy_func,
        ),
    >,
    pub godot_nativescript_register_method: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_function_name: *const libc::c_char,
            p_attr: godot_method_attributes,
            p_method: godot_instance_method,
        ),
    >,
    pub godot_nativescript_register_property: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_path: *const libc::c_char,
            p_attr: *mut godot_property_attributes,
            p_set_func: godot_property_set_func,
            p_get_func: godot_property_get_func,
        ),
    >,
    pub godot_nativescript_register_signal: ::std::option::Option<
        unsafe extern "C" fn(
            p_gdnative_handle: *mut libc::c_void,
            p_name: *const libc::c_char,
            p_signal: *const godot_signal,
        ),
    >,
    pub godot_nativescript_get_userdata: ::std::option::Option<
        unsafe extern "C" fn(p_instance: *mut godot_object) -> *mut libc::c_void,
    >,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_nativescript_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_nativescript_api_struct>(),
        72usize,
        concat!(
            "Size of: ",
            stringify!(godot_gdnative_ext_nativescript_api_struct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_nativescript_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_nativescript_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_nativescript_register_class() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_register_class) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(godot_nativescript_register_class)
            )
        );
    }
    test_field_godot_nativescript_register_class();
    fn test_field_godot_nativescript_register_tool_class() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_register_tool_class) as usize
                    - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(godot_nativescript_register_tool_class)
            )
        );
    }
    test_field_godot_nativescript_register_tool_class();
    fn test_field_godot_nativescript_register_method() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_register_method) as usize
                    - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(godot_nativescript_register_method)
            )
        );
    }
    test_field_godot_nativescript_register_method();
    fn test_field_godot_nativescript_register_property() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_register_property) as usize
                    - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(godot_nativescript_register_property)
            )
        );
    }
    test_field_godot_nativescript_register_property();
    fn test_field_godot_nativescript_register_signal() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_register_signal) as usize
                    - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(godot_nativescript_register_signal)
            )
        );
    }
    test_field_godot_nativescript_register_signal();
    fn test_field_godot_nativescript_get_userdata() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_nativescript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_nativescript_get_userdata) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_nativescript_api_struct),
                "::",
                stringify!(godot_nativescript_get_userdata)
            )
        );
    }
    test_field_godot_nativescript_get_userdata();
}
impl Default for godot_gdnative_ext_nativescript_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_pluginscript_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_pluginscript_register_language: ::std::option::Option<
        unsafe extern "C" fn(language_desc: *const godot_pluginscript_language_desc),
    >,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_pluginscript_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_pluginscript_api_struct>(),
        32usize,
        concat!(
            "Size of: ",
            stringify!(godot_gdnative_ext_pluginscript_api_struct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_pluginscript_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_pluginscript_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_pluginscript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_pluginscript_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_pluginscript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_pluginscript_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_pluginscript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_pluginscript_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_pluginscript_register_language() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_pluginscript_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_pluginscript_register_language) as usize
                    - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_pluginscript_api_struct),
                "::",
                stringify!(godot_pluginscript_register_language)
            )
        );
    }
    test_field_godot_pluginscript_register_language();
}
impl Default for godot_gdnative_ext_pluginscript_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_android_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_android_get_env: ::std::option::Option<unsafe extern "C" fn() -> *mut libc::c_void>,
    pub godot_android_get_activity:
        ::std::option::Option<unsafe extern "C" fn() -> *mut libc::c_void>,
    pub godot_android_get_surface:
        ::std::option::Option<unsafe extern "C" fn() -> *mut libc::c_void>,
    pub godot_android_is_activity_resumed: ::std::option::Option<unsafe extern "C" fn() -> bool>,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_android_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_android_api_struct>(),
        56usize,
        concat!(
            "Size of: ",
            stringify!(godot_gdnative_ext_android_api_struct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_android_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_android_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_android_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_android_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_android_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_android_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_android_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_android_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_android_get_env() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_android_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_android_get_env) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_android_api_struct),
                "::",
                stringify!(godot_android_get_env)
            )
        );
    }
    test_field_godot_android_get_env();
    fn test_field_godot_android_get_activity() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_android_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_android_get_activity) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_android_api_struct),
                "::",
                stringify!(godot_android_get_activity)
            )
        );
    }
    test_field_godot_android_get_activity();
    fn test_field_godot_android_get_surface() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_android_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_android_get_surface) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_android_api_struct),
                "::",
                stringify!(godot_android_get_surface)
            )
        );
    }
    test_field_godot_android_get_surface();
    fn test_field_godot_android_is_activity_resumed() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_android_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_android_is_activity_resumed) as usize
                    - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_android_api_struct),
                "::",
                stringify!(godot_android_is_activity_resumed)
            )
        );
    }
    test_field_godot_android_is_activity_resumed();
}
impl Default for godot_gdnative_ext_android_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_arvr_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_arvr_register_interface: ::std::option::Option<
        unsafe extern "C" fn(p_interface: *const godot_arvr_interface_gdnative),
    >,
    pub godot_arvr_get_worldscale: ::std::option::Option<unsafe extern "C" fn() -> godot_real>,
    pub godot_arvr_get_reference_frame:
        ::std::option::Option<unsafe extern "C" fn() -> godot_transform>,
    pub godot_arvr_blit: ::std::option::Option<
        unsafe extern "C" fn(
            p_eye: libc::c_int,
            p_render_target: *mut godot_rid,
            p_screen_rect: *mut godot_rect2,
        ),
    >,
    pub godot_arvr_get_texid:
        ::std::option::Option<unsafe extern "C" fn(p_render_target: *mut godot_rid) -> godot_int>,
    pub godot_arvr_add_controller: ::std::option::Option<
        unsafe extern "C" fn(
            p_device_name: *mut libc::c_char,
            p_hand: godot_int,
            p_tracks_orientation: godot_bool,
            p_tracks_position: godot_bool,
        ) -> godot_int,
    >,
    pub godot_arvr_remove_controller:
        ::std::option::Option<unsafe extern "C" fn(p_controller_id: godot_int)>,
    pub godot_arvr_set_controller_transform: ::std::option::Option<
        unsafe extern "C" fn(
            p_controller_id: godot_int,
            p_transform: *mut godot_transform,
            p_tracks_orientation: godot_bool,
            p_tracks_position: godot_bool,
        ),
    >,
    pub godot_arvr_set_controller_button: ::std::option::Option<
        unsafe extern "C" fn(
            p_controller_id: godot_int,
            p_button: godot_int,
            p_is_pressed: godot_bool,
        ),
    >,
    pub godot_arvr_set_controller_axis: ::std::option::Option<
        unsafe extern "C" fn(
            p_controller_id: godot_int,
            p_exis: godot_int,
            p_value: godot_real,
            p_can_be_negative: godot_bool,
        ),
    >,
    pub godot_arvr_get_controller_rumble:
        ::std::option::Option<unsafe extern "C" fn(p_controller_id: godot_int) -> godot_real>,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_arvr_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_arvr_api_struct>(),
        112usize,
        concat!("Size of: ", stringify!(godot_gdnative_ext_arvr_api_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_arvr_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_arvr_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_arvr_register_interface() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_register_interface) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_register_interface)
            )
        );
    }
    test_field_godot_arvr_register_interface();
    fn test_field_godot_arvr_get_worldscale() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_get_worldscale) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_get_worldscale)
            )
        );
    }
    test_field_godot_arvr_get_worldscale();
    fn test_field_godot_arvr_get_reference_frame() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_get_reference_frame) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_get_reference_frame)
            )
        );
    }
    test_field_godot_arvr_get_reference_frame();
    fn test_field_godot_arvr_blit() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_blit) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_blit)
            )
        );
    }
    test_field_godot_arvr_blit();
    fn test_field_godot_arvr_get_texid() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_get_texid) as usize - ptr as usize
            },
            56usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_get_texid)
            )
        );
    }
    test_field_godot_arvr_get_texid();
    fn test_field_godot_arvr_add_controller() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_add_controller) as usize - ptr as usize
            },
            64usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_add_controller)
            )
        );
    }
    test_field_godot_arvr_add_controller();
    fn test_field_godot_arvr_remove_controller() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_remove_controller) as usize - ptr as usize
            },
            72usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_remove_controller)
            )
        );
    }
    test_field_godot_arvr_remove_controller();
    fn test_field_godot_arvr_set_controller_transform() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_set_controller_transform) as usize
                    - ptr as usize
            },
            80usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_set_controller_transform)
            )
        );
    }
    test_field_godot_arvr_set_controller_transform();
    fn test_field_godot_arvr_set_controller_button() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_set_controller_button) as usize
                    - ptr as usize
            },
            88usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_set_controller_button)
            )
        );
    }
    test_field_godot_arvr_set_controller_button();
    fn test_field_godot_arvr_set_controller_axis() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_set_controller_axis) as usize - ptr as usize
            },
            96usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_set_controller_axis)
            )
        );
    }
    test_field_godot_arvr_set_controller_axis();
    fn test_field_godot_arvr_get_controller_rumble() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_arvr_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_arvr_get_controller_rumble) as usize
                    - ptr as usize
            },
            104usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_arvr_api_struct),
                "::",
                stringify!(godot_arvr_get_controller_rumble)
            )
        );
    }
    test_field_godot_arvr_get_controller_rumble();
}
impl Default for godot_gdnative_ext_arvr_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_videodecoder_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_videodecoder_file_read: ::std::option::Option<
        unsafe extern "C" fn(
            file_ptr: *mut libc::c_void,
            buf: *mut u8,
            buf_size: libc::c_int,
        ) -> godot_int,
    >,
    pub godot_videodecoder_file_seek: ::std::option::Option<
        unsafe extern "C" fn(file_ptr: *mut libc::c_void, pos: i64, whence: libc::c_int) -> i64,
    >,
    pub godot_videodecoder_register_decoder: ::std::option::Option<
        unsafe extern "C" fn(p_interface: *const godot_videodecoder_interface_gdnative),
    >,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_videodecoder_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_videodecoder_api_struct>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(godot_gdnative_ext_videodecoder_api_struct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_videodecoder_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_videodecoder_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_videodecoder_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_videodecoder_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_videodecoder_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_videodecoder_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_videodecoder_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_videodecoder_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_videodecoder_file_read() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_videodecoder_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_videodecoder_file_read) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_videodecoder_api_struct),
                "::",
                stringify!(godot_videodecoder_file_read)
            )
        );
    }
    test_field_godot_videodecoder_file_read();
    fn test_field_godot_videodecoder_file_seek() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_videodecoder_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_videodecoder_file_seek) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_videodecoder_api_struct),
                "::",
                stringify!(godot_videodecoder_file_seek)
            )
        );
    }
    test_field_godot_videodecoder_file_seek();
    fn test_field_godot_videodecoder_register_decoder() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_videodecoder_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_videodecoder_register_decoder) as usize
                    - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_videodecoder_api_struct),
                "::",
                stringify!(godot_videodecoder_register_decoder)
            )
        );
    }
    test_field_godot_videodecoder_register_decoder();
}
impl Default for godot_gdnative_ext_videodecoder_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_net_3_2_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_net_set_webrtc_library: ::std::option::Option<
        unsafe extern "C" fn(p_library: *const godot_net_webrtc_library) -> godot_error,
    >,
    pub godot_net_bind_webrtc_peer_connection: ::std::option::Option<
        unsafe extern "C" fn(
            p_obj: *mut godot_object,
            p_interface: *const godot_net_webrtc_peer_connection,
        ),
    >,
    pub godot_net_bind_webrtc_data_channel: ::std::option::Option<
        unsafe extern "C" fn(
            p_obj: *mut godot_object,
            p_interface: *const godot_net_webrtc_data_channel,
        ),
    >,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_net_3_2_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_net_3_2_api_struct>(),
        48usize,
        concat!(
            "Size of: ",
            stringify!(godot_gdnative_ext_net_3_2_api_struct)
        )
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_net_3_2_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_net_3_2_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_net_3_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_3_2_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_net_3_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_3_2_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_net_3_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_3_2_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_net_set_webrtc_library() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_net_3_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_net_set_webrtc_library) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_3_2_api_struct),
                "::",
                stringify!(godot_net_set_webrtc_library)
            )
        );
    }
    test_field_godot_net_set_webrtc_library();
    fn test_field_godot_net_bind_webrtc_peer_connection() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_net_3_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_net_bind_webrtc_peer_connection) as usize
                    - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_3_2_api_struct),
                "::",
                stringify!(godot_net_bind_webrtc_peer_connection)
            )
        );
    }
    test_field_godot_net_bind_webrtc_peer_connection();
    fn test_field_godot_net_bind_webrtc_data_channel() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_ext_net_3_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_net_bind_webrtc_data_channel) as usize
                    - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_3_2_api_struct),
                "::",
                stringify!(godot_net_bind_webrtc_data_channel)
            )
        );
    }
    test_field_godot_net_bind_webrtc_data_channel();
}
impl Default for godot_gdnative_ext_net_3_2_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_ext_net_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_net_bind_stream_peer: ::std::option::Option<
        unsafe extern "C" fn(p_obj: *mut godot_object, p_interface: *const godot_net_stream_peer),
    >,
    pub godot_net_bind_packet_peer: ::std::option::Option<
        unsafe extern "C" fn(p_obj: *mut godot_object, p_interface: *const godot_net_packet_peer),
    >,
    pub godot_net_bind_multiplayer_peer: ::std::option::Option<
        unsafe extern "C" fn(
            p_obj: *mut godot_object,
            p_interface: *const godot_net_multiplayer_peer,
        ),
    >,
}
#[test]
fn bindgen_test_layout_godot_gdnative_ext_net_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_ext_net_api_struct>(),
        48usize,
        concat!("Size of: ", stringify!(godot_gdnative_ext_net_api_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_ext_net_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_ext_net_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_ext_net_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_ext_net_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_ext_net_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_net_bind_stream_peer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_ext_net_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_net_bind_stream_peer) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_api_struct),
                "::",
                stringify!(godot_net_bind_stream_peer)
            )
        );
    }
    test_field_godot_net_bind_stream_peer();
    fn test_field_godot_net_bind_packet_peer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_ext_net_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_net_bind_packet_peer) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_api_struct),
                "::",
                stringify!(godot_net_bind_packet_peer)
            )
        );
    }
    test_field_godot_net_bind_packet_peer();
    fn test_field_godot_net_bind_multiplayer_peer() {
        assert_eq!(
            unsafe {
                let uninit = ::std::mem::MaybeUninit::<godot_gdnative_ext_net_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_net_bind_multiplayer_peer) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_ext_net_api_struct),
                "::",
                stringify!(godot_net_bind_multiplayer_peer)
            )
        );
    }
    test_field_godot_net_bind_multiplayer_peer();
}
impl Default for godot_gdnative_ext_net_api_struct {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct godot_gdnative_core_1_2_api_struct {
    pub type_: libc::c_uint,
    pub version: godot_gdnative_api_version,
    pub next: *const godot_gdnative_api_struct,
    pub godot_dictionary_duplicate: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_dictionary,
            p_deep: godot_bool,
        ) -> godot_dictionary,
    >,
    pub godot_vector3_move_toward: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_vector3,
            p_to: *const godot_vector3,
            p_delta: godot_real,
        ) -> godot_vector3,
    >,
    pub godot_vector2_move_toward: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_vector2,
            p_to: *const godot_vector2,
            p_delta: godot_real,
        ) -> godot_vector2,
    >,
    pub godot_string_count: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_string,
            p_what: godot_string,
            p_from: godot_int,
            p_to: godot_int,
        ) -> godot_int,
    >,
    pub godot_string_countn: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_string,
            p_what: godot_string,
            p_from: godot_int,
            p_to: godot_int,
        ) -> godot_int,
    >,
    pub godot_vector3_direction_to: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_vector3,
            p_to: *const godot_vector3,
        ) -> godot_vector3,
    >,
    pub godot_vector2_direction_to: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_vector2,
            p_to: *const godot_vector2,
        ) -> godot_vector2,
    >,
    pub godot_array_slice: ::std::option::Option<
        unsafe extern "C" fn(
            p_self: *const godot_array,
            p_begin: godot_int,
            p_end: godot_int,
            p_step: godot_int,
            p_deep: godot_bool,
        ) -> godot_array,
    >,
    pub godot_pool_byte_array_empty: ::std::option::Option<
        unsafe extern "C" fn(p_self: *const godot_pool_byte_array) -> godot_bool,
    >,
    pub godot_pool_int_array_empty: ::std::option::Option<
        unsafe extern "C" fn(p_self: *const godot_pool_int_array) -> godot_bool,
    >,
    pub godot_pool_real_array_empty: ::std::option::Option<
        unsafe extern "C" fn(p_self: *const godot_pool_real_array) -> godot_bool,
    >,
    pub godot_pool_string_array_empty: ::std::option::Option<
        unsafe extern "C" fn(p_self: *const godot_pool_string_array) -> godot_bool,
    >,
    pub godot_pool_vector2_array_empty: ::std::option::Option<
        unsafe extern "C" fn(p_self: *const godot_pool_vector2_array) -> godot_bool,
    >,
    pub godot_pool_vector3_array_empty: ::std::option::Option<
        unsafe extern "C" fn(p_self: *const godot_pool_vector3_array) -> godot_bool,
    >,
    pub godot_pool_color_array_empty: ::std::option::Option<
        unsafe extern "C" fn(p_self: *const godot_pool_color_array) -> godot_bool,
    >,
    pub godot_get_class_tag: ::std::option::Option<
        unsafe extern "C" fn(p_class: *const godot_string_name) -> *mut libc::c_void,
    >,
    pub godot_object_cast_to: ::std::option::Option<
        unsafe extern "C" fn(
            p_object: *const godot_object,
            p_class_tag: *mut libc::c_void,
        ) -> *mut godot_object,
    >,
    pub godot_instance_from_id:
        ::std::option::Option<unsafe extern "C" fn(p_instance_id: godot_int) -> *mut godot_object>,
}
#[test]
fn bindgen_test_layout_godot_gdnative_core_1_2_api_struct() {
    assert_eq!(
        ::std::mem::size_of::<godot_gdnative_core_1_2_api_struct>(),
        168usize,
        concat!("Size of: ", stringify!(godot_gdnative_core_1_2_api_struct))
    );
    assert_eq!(
        ::std::mem::align_of::<godot_gdnative_core_1_2_api_struct>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(godot_gdnative_core_1_2_api_struct)
        )
    );
    fn test_field_type() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_core_1_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize
            },
            0usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_core_1_2_api_struct),
                "::",
                stringify!(type_)
            )
        );
    }
    test_field_type();
    fn test_field_version() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_core_1_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).version) as usize - ptr as usize
            },
            4usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_core_1_2_api_struct),
                "::",
                stringify!(version)
            )
        );
    }
    test_field_version();
    fn test_field_next() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_core_1_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).next) as usize - ptr as usize
            },
            16usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_core_1_2_api_struct),
                "::",
                stringify!(next)
            )
        );
    }
    test_field_next();
    fn test_field_godot_dictionary_duplicate() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_core_1_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_dictionary_duplicate) as usize - ptr as usize
            },
            24usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_core_1_2_api_struct),
                "::",
                stringify!(godot_dictionary_duplicate)
            )
        );
    }
    test_field_godot_dictionary_duplicate();
    fn test_field_godot_vector3_move_toward() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_core_1_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_vector3_move_toward) as usize - ptr as usize
            },
            32usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_core_1_2_api_struct),
                "::",
                stringify!(godot_vector3_move_toward)
            )
        );
    }
    test_field_godot_vector3_move_toward();
    fn test_field_godot_vector2_move_toward() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_core_1_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_vector2_move_toward) as usize - ptr as usize
            },
            40usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_core_1_2_api_struct),
                "::",
                stringify!(godot_vector2_move_toward)
            )
        );
    }
    test_field_godot_vector2_move_toward();
    fn test_field_godot_string_count() {
        assert_eq!(
            unsafe {
                let uninit =
                    ::std::mem::MaybeUninit::<godot_gdnative_core_1_2_api_struct>::uninit();
                let ptr = uninit.as_ptr();
                ::std::ptr::addr_of!((*ptr).godot_string_count) as usize - ptr as usize
            },
            48usize,
            concat!(
                "Offset of field: ",
                stringify!(godot_gdnative_core_1_2_api_struct),
                "::",
                stringify!(godot_string_count)
            )
        );
    }
    test_field_godot_string_count();
    fn test_field_godot_string_countn() {
        assert_eq!(
            unsafe {
